Функция ПолучитьСписокИдентификаторовПользователя(ТекПользователь,ТипПодписки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграмПодписчики.id
		|ИЗ
		|	РегистрСведений.ТелеграмПодписчики КАК ТелеграмПодписчики
		|ГДЕ
		|	ТелеграмПодписчики.ТипПодписки = &ТипПодписки
		|	И ТелеграмПодписчики.Пользователь = &Пользователь
		|	И ТелеграмПодписчики.ДоступРазрешен = ИСТИНА";
	
	Запрос.УстановитьПараметр("Пользователь", ТекПользователь);
	Запрос.УстановитьПараметр("ТипПодписки", ТипПодписки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокВозврата = Новый СписокЗначений();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИдВозврата = ВыборкаДетальныеЗаписи.id;
		СписокВозврата.Добавить(ИдВозврата);
	КонецЦикла;
	
	Возврат СписокВозврата;
КонецФункции

Процедура ПроверкаКомандТелеграм() Экспорт
	ТелеграмЗадания.ПолучитьUpdate();
	ТелеграмЗадания.ОбработатьЗапросы();
КонецПроцедуры

Процедура ВыполнениеРассылкиНаТелеграм() Экспорт
	
	
КонецПроцедуры

Функция ПолучитьТаблицуПодписчиковПоТипуПодписки(ТипПодписки) Экспорт
	
	Ключ = ТелеграмЗадания.ПолучитьКлючТелеграм();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТелеграмПодписчики.id,
		|	ТелеграмПодписчики.date
		|ИЗ
		|	РегистрСведений.ТелеграмПодписчики КАК ТелеграмПодписчики
		|ГДЕ
		|	ТелеграмПодписчики.ДоступРазрешен = ИСТИНА
		|	И ТелеграмПодписчики.КлючТелеграм = &Ключ
		|	И ТелеграмПодписчики.ТипПодписки = &ТипПодписки";
		
	Запрос.УстановитьПараметр("ТипПодписки",ТипПодписки);
	Запрос.УстановитьПараметр("Ключ",Ключ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаПодписчиков = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаПодписчиков;
КонецФункции	