////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ИспользуютсяКлассификаторы = УправлениеКонтактнойИнформациейКлассификаторы.ИспользуютсяКлассификаторы();
	
	Если Не ИспользуютсяКлассификаторы Тогда
		Элементы.Классификатор.Видимость = Ложь;
	КонецЕсли;
	
	ПрочитатьЗначенияПараметров();
	
	ПредставлениеСВидом = НаименованиеВида + ": " + Представление;
	Заголовок = НаименованиеВида;
	
	СтранаРоссия = Справочники.СтраныМира.Россия;
	
	Если Параметры.АдресТолькоРоссийский Тогда
		
		Страна = СтранаРоссия;
		Элементы.Страна.Доступность = Ложь;
		Элементы.Страна.КнопкаВыбора = Ложь;
		
	Иначе
		
		Если Не ПустаяСтрока(КодСтраны) ИЛИ Не ПустаяСтрока(НаименованиеСтраны) Тогда
			// если задан код или наименование страны, то найдем страну
			НайтиСтрануПоКодуИлиНаименованию(КодСтраны, НаименованиеСтраны);
		Иначе
			Страна = СтранаРоссия;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Страна) Тогда
		ЗаполнитьКодИНаименованиеСтраны();
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Параметры.Заголовок) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьТипыПолей();
	ПроверитьКнопкиВыбора();
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
	ОбщегоНазначенияКлиент.ЗапроситьПодтверждениеЗакрытияФормы(Отказ,ЗавершениеРаботы,Модифицированность, БылиНажатыКнопкиЗакрытия,ТекстПредупреждения); 
	
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Страна) Тогда
		Страна = СтранаРоссия;
	КонецЕсли;
	
	ЗаполнитьКодИНаименованиеСтраны();
	
	СформироватьПредставление();
	ПроверитьКнопкиВыбора();
	
	Если Страна <> СтранаРоссия Тогда
		// Разрешаем вводить любые адреса
		Элементы.Район.Доступность 				= Истина;
		Элементы.Город.Доступность 				= Истина;
		Элементы.НаселенныйПункт.Доступность 	= Истина;
		Элементы.Улица.Доступность 				= Истина;
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексПриИзменении(Элемент)
	
	
	
	СформироватьПредставление();

КонецПроцедуры

&НаКлиенте
Процедура ПолеПриИзменении(Элемент)
	
	ПроверитьТипыПолей();
	
	
	
	СформироватьПредставление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если (Не ИспользуютсяКлассификаторы) ИЛИ (Страна <> СтранаРоссия) Тогда
		Возврат;
	КонецЕсли;
	
	Уровень = ПолучитьУровеньЭлемента(Элемент);
	СтруктураАдреса = ПолучитьСтруктуруАдреса();
	СтруктураАдреса.Вставить("Уровень", Уровень);
	
	
	
	СформироватьПредставление();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПередВыборомАдресногоЭлемента(Регион, СкрыватьНеактуальныеАдреса, ПроверяетсяРегион)
	
	Если Не ПроверяетсяРегион И НЕ ПустаяСтрока(Регион) Тогда
		
		РегионЗагружен = УправлениеКонтактнойИнформациейКлассификаторы.АдресныйЭлементЗагружен(Регион);
		Если Не РегионЗагружен Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ВводАдреса", "СкрыватьНеактуальныеАдреса", СкрыватьНеактуальныеАдреса);
	Возврат Ложь;
	
КонецФункции




////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаОтменаВыполнить()
	
	БылиНажатыКнопкиЗакрытия = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОКВыполнить()
	
	БылиНажатыКнопкиЗакрытия = Истина;
	Закрыть(ПолучитьРезультатРедактирования());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьВыполнить()
	
	Модифицированность = Истина;
	
	Страна = СтранаРоссия;
	СтранаПриИзменении(Элементы.Страна);
	
	Индекс = "";
	Регион = "";
	Район = "";
	Город = "";
	НаселенныйПункт = "";
	Улица = "";
	Дом = "";
	Корпус = "";
	Квартира = "";
	ТипДома     = Элементы.ТипДома.СписокВыбора[0].Значение;
	ТипКорпуса  = Элементы.ТипКорпуса.СписокВыбора[0].Значение;
	ТипКвартиры = Элементы.ТипКвартиры.СписокВыбора[0].Значение;
	
	СформироватьПредставление();
	
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПолучитьУровеньЭлемента(Элемент)
	
	Если Элемент = Элементы.Регион Тогда
		Возврат 1;
		
	ИначеЕсли Элемент = Элементы.Район Тогда
		Возврат 2;
		
	ИначеЕсли Элемент = Элементы.Город Тогда
		Возврат 3;
		
	ИначеЕсли Элемент = Элементы.НаселенныйПункт Тогда
		Возврат 4;
		
	ИначеЕсли Элемент = Элементы.Улица Тогда
		Возврат 5;
		
	ИначеЕсли Элемент = Элементы.Дом ИЛИ Элемент = Элементы.Корпус Тогда
		Возврат 6;
		
	Иначе
		Возврат 0;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура СформироватьПредставление()
	
	Представление = "";
	
	СтруктураАдреса = ПолучитьСтруктуруАдреса();
	СтруктураАдреса.Вставить("Страна", ?(Страна <> СтранаРоссия, Страна, Неопределено));
	СтруктураАдреса.Вставить("НаименованиеСтраны", ?(Страна <> СтранаРоссия, НаименованиеСтраны, ""));
	СтруктураАдреса.Вставить("ТипДома",	ТипДома);
	СтруктураАдреса.Вставить("ТипКорпуса",	ТипКорпуса);
	СтруктураАдреса.Вставить("ТипКвартиры",	ТипКвартиры);
	СтруктураАдреса.Вставить("НаименованиеВида", НаименованиеВида);
	СтруктураАдреса.Вставить("Представление", Представление);
	
	ПредставлениеСВидом = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеАдреса(СтруктураАдреса
	, Представление, НаименованиеВида);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЗначенияПараметров()
	
	Представление    = Параметры.Представление;
	НаименованиеВида = Строка(Параметры.Вид);
	
	Для Каждого ЭлементАдреса Из Параметры.ЗначенияПолей Цикл
		// Для Страны - отдельная обработка, т.к. в отличие от других полей это ссылочный тип
		Если ЭлементАдреса.Представление = "Страна" Тогда
			Страна = Справочники.СтраныМира.НайтиПоНаименованию(ЭлементАдреса.Значение);
		Иначе
			ЭтотОбъект[ЭлементАдреса.Представление] = ЭлементАдреса.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначениеПоля(Значение, ИмяПоля)
	
	Если ЗначениеЗаполнено(Значение) Тогда
		ЗначенияПолей.Добавить(Значение, ИмяПоля);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРезультатРедактирования()

	ЗначенияПолей.Очистить();
	ДобавитьЗначениеПоля(Индекс,              "Индекс");
	ДобавитьЗначениеПоля(КодРегиона,          "КодРегиона");
	ДобавитьЗначениеПоля(Регион,              "Регион");
	ДобавитьЗначениеПоля(Район,               "Район");
	ДобавитьЗначениеПоля(Город,               "Город");
	ДобавитьЗначениеПоля(НаселенныйПункт,     "НаселенныйПункт");
	ДобавитьЗначениеПоля(Улица,               "Улица");
	ДобавитьЗначениеПоля(Дом,                 "Дом");
	ДобавитьЗначениеПоля(Корпус,              "Корпус");
	ДобавитьЗначениеПоля(Квартира,            "Квартира");
	ДобавитьЗначениеПоля(НаименованиеСтраны,  "Страна");
	ДобавитьЗначениеПоля(КодСтраны,           "КодСтраны");
	
	Если Не ПустаяСтрока(Дом) Тогда
		ДобавитьЗначениеПоля(ТипДома,         "ТипДома");
	КонецЕсли;
	Если Не ПустаяСтрока(Корпус) Тогда
		ДобавитьЗначениеПоля(ТипКорпуса,      "ТипКорпуса");
	КонецЕсли;
	Если Не ПустаяСтрока(Квартира) Тогда
		ДобавитьЗначениеПоля(ТипКвартиры,     "ТипКвартиры");
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЗначенияПолей", ЗначенияПолей);
	Результат.Вставить("Представление", Представление);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ПроверитьТипыПолей()
	
	ТипДома     = ?(ЗначениеЗаполнено(ТипДома),     ТипДома,     Элементы.ТипДома.СписокВыбора[0].Значение);
	ТипКорпуса  = ?(ЗначениеЗаполнено(ТипКорпуса),  ТипКорпуса,  Элементы.ТипКорпуса.СписокВыбора[0].Значение);
	ТипКвартиры = ?(ЗначениеЗаполнено(ТипКвартиры), ТипКвартиры, Элементы.ТипКвартиры.СписокВыбора[0].Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКнопкиВыбора()
	
	ЕстьКнопки = ИспользуютсяКлассификаторы И (Страна = СтранаРоссия);
	
	Элементы.Регион.КнопкаВыбора          = ЕстьКнопки;
	Элементы.Район.КнопкаВыбора           = ЕстьКнопки;
	Элементы.Город.КнопкаВыбора           = ЕстьКнопки;
	Элементы.НаселенныйПункт.КнопкаВыбора = ЕстьКнопки;
	Элементы.Улица.КнопкаВыбора           = ЕстьКнопки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКодИНаименованиеСтраны()
	
	ЗначенияРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Страна, "Код, Наименование");
	КодСтраны = ЗначенияРеквизитов.Код;
	НаименованиеСтраны = ЗначенияРеквизитов.Наименование;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НайтиСтрануПоКодуИлиНаименованию(КодСтраны, НаименованиеСтраны)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодСтраны", КодСтраны);
	Запрос.УстановитьПараметр("НаименованиеСтраны", НаименованиеСтраны);
	
	Если ПустаяСтрока(КодСтраны) ИЛИ ПустаяСтрока(НаименованиеСтраны) Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СтраныМира.Ссылка КАК Страна
		|ИЗ
		|	Справочник.СтраныМира КАК СтраныМира
		|ГДЕ
		|	СтраныМира.Код = &КодСтраны";
		Если ПустаяСтрока(КодСтраны) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Код", "Наименование");
		КонецЕсли;
		
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Страны.Ссылка КАК Страна
		|ИЗ
		|	(ВЫБРАТЬ ПЕРВЫЕ 1
		|		СтраныМира.Ссылка КАК Ссылка,
		|		1 КАК Порядок
		|	ИЗ
		|		Справочник.СтраныМира КАК СтраныМира
		|	ГДЕ
		|		СтраныМира.Код = &КодСтраны
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ ПЕРВЫЕ 1
		|		СтраныМира.Ссылка КАК Ссылка,
		|		2
		|	ИЗ
		|		Справочник.СтраныМира КАК СтраныМира
		|	ГДЕ
		|		СтраныМира.Наименование = &НаименованиеСтраны) КАК Страны
		|
		|УПОРЯДОЧИТЬ ПО
		|	Страны.Порядок";
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Страна = ?(Выборка.Следующий(), Выборка.Страна, Справочники.СтраныМира.ПустаяСсылка());
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруАдреса()
	
	СтруктураАдреса = Новый Структура();
	СтруктураАдреса.Вставить("Индекс", Индекс);
	СтруктураАдреса.Вставить("Регион", Регион);
	СтруктураАдреса.Вставить("Район", Район);
	СтруктураАдреса.Вставить("Город", Город);
	СтруктураАдреса.Вставить("НаселенныйПункт", НаселенныйПункт);
	СтруктураАдреса.Вставить("Улица", Улица);
	СтруктураАдреса.Вставить("Дом", Дом);
	СтруктураАдреса.Вставить("Корпус", Корпус);
	СтруктураАдреса.Вставить("Квартира", Квартира);
	Возврат СтруктураАдреса;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьСтруктуруАдреса(СтруктураАдреса)
	
	Если Индекс <> СтруктураАдреса.Индекс Тогда
		Индекс = СтруктураАдреса.Индекс;
	КонецЕсли;
	Если Регион <> СтруктураАдреса.Регион Тогда
		Регион = СтруктураАдреса.Регион;
	КонецЕсли;
	Если Район <> СтруктураАдреса.Район Тогда
		Район = СтруктураАдреса.Район;
	КонецЕсли;
	Если Город <> СтруктураАдреса.Город Тогда
		Город = СтруктураАдреса.Город;
	КонецЕсли;
	Если НаселенныйПункт <> СтруктураАдреса.НаселенныйПункт Тогда
		НаселенныйПункт = СтруктураАдреса.НаселенныйПункт;
	КонецЕсли;
	Если Улица <> СтруктураАдреса.Улица Тогда
		Улица = СтруктураАдреса.Улица;
	КонецЕсли;
	Если Дом <> СтруктураАдреса.Дом Тогда
		Дом = СтруктураАдреса.Дом;
	КонецЕсли;
	Если Корпус <> СтруктураАдреса.Корпус Тогда
		Корпус = СтруктураАдреса.Корпус;
	КонецЕсли;
	Если Квартира <> СтруктураАдреса.Квартира Тогда
		Квартира = СтруктураАдреса.Квартира;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСтруктуруАдресаНаСервере(СтруктураАдреса)
	
	Если Индекс <> СтруктураАдреса.Индекс Тогда
		Индекс = СтруктураАдреса.Индекс;
	КонецЕсли;
	Если Регион <> СтруктураАдреса.Регион Тогда
		Регион = СтруктураАдреса.Регион;
	КонецЕсли;
	Если Район <> СтруктураАдреса.Район Тогда
		Район = СтруктураАдреса.Район;
	КонецЕсли;
	Если Город <> СтруктураАдреса.Город Тогда
		Город = СтруктураАдреса.Город;
	КонецЕсли;
	Если НаселенныйПункт <> СтруктураАдреса.НаселенныйПункт Тогда
		НаселенныйПункт = СтруктураАдреса.НаселенныйПункт;
	КонецЕсли;
	Если Улица <> СтруктураАдреса.Улица Тогда
		Улица = СтруктураАдреса.Улица;
	КонецЕсли;
	Если Дом <> СтруктураАдреса.Дом Тогда
		Дом = СтруктураАдреса.Дом;
	КонецЕсли;
	Если Корпус <> СтруктураАдреса.Корпус Тогда
		Корпус = СтруктураАдреса.Корпус;
	КонецЕсли;
	Если Квартира <> СтруктураАдреса.Квартира Тогда
		Квартира = СтруктураАдреса.Квартира;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруАдресаНаСервере()
	
	СтруктураАдреса = Новый Структура();
	СтруктураАдреса.Вставить("Индекс", Индекс);
	СтруктураАдреса.Вставить("Регион", Регион);
	СтруктураАдреса.Вставить("Район", Район);
	СтруктураАдреса.Вставить("Город", Город);
	СтруктураАдреса.Вставить("НаселенныйПункт", НаселенныйПункт);
	СтруктураАдреса.Вставить("Улица", Улица);
	СтруктураАдреса.Вставить("Дом", Дом);
	СтруктураАдреса.Вставить("Корпус", Корпус);
	СтруктураАдреса.Вставить("Квартира", Квартира);
	Возврат СтруктураАдреса;
	
КонецФункции

&НаКлиенте
Процедура Классификатор(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьЗаполнения(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СкрыватьНеактуальныеАдреса(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


