////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Используются ли в конфигурации классификаторы
//
// Возвращаемое значение:
//  Булево - Истина, если используются, Ложь - Иначе.
//
Функция ИспользуютсяКлассификаторы() Экспорт
	
	Возврат Ложь;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Экспортные функции, вызываемые из формы Ввода адреса

// СтрНайти по индексу записи в адресном классификаторе.
//
// Параметры:
//	Индекс - Строка - индекс, по которому будет производиться поиск 
//
// Возвращаемое значение:
//  Структура - с полями:
//    Количество      - Число - количество найденных вариантов
//    НайденныйРегион - Строка - если найден один регион
//    НайденныйРайон  - Строка - если найден один район
//    ПризнакАктуальности - Число - признак актуальности если найден один вариант
//    АдресВХранилище - Строка - идентификатор сохраненной в хранилище таблицы с найдеными вариантами
//
Функция НайтиЗаписиВАКПоИндексу(Индекс) Экспорт

	Возврат "";
	
КонецФункции

// Получить компоненты адресного элемента по его коду
//
// Параметры:
//	КодАдресногоЭлемента - Число - код адресного элемента, по которому ищутся компоненты адреса 
//	Результат - структура с полями(в которую выгружается результат поиска):
//		Регион - Строка - наименование найденого региона
//		Район - Строка - наименование найденого района
//		Город - Строка - наименование найденого города
//		НаселенныйПункт - Строка - наименование найденого населенного пункта
//		Улица - Строка - наименование найденой улицы
//		ПризнакАктуальности - Число - признак актуальности найденого адреса
//
Процедура ПоКодуАдресногоЭлементаВСтруктуруПолучитьЕгоКомпоненты(КодАдресногоЭлемента, Результат) Экспорт
	
	Возврат;
	
КонецПроцедуры

//  Процедура очищает потомков определенного адресного элемента
//
// Параметры:
//  Регион - строка - строка, куда будет помещено строковое представление "родительского" региона.
//  Район - строка - строка, куда будет помещено строковое представление "родительского" района.
//  Город - строка - строка, куда будет помещено строковое представление "родительского" города.
//  НаселенныйПункт - строка - строка, куда будет помещено строковое представление "родительского" населенного пункта.
//  Улица - строка - строка, куда будет помещено строковое представление "родительской" улицы.
//  Дом - строка - строка, куда будет помещено строковое представление "родительского" номера дома.
//  Корпус - строка - строка, куда будет помещено строковое представление "родительского" номера корпуса дома.
//  Квартира - строка - строка, куда будет помещено строковое представление "родительского" номера квартиры.
//  Уровень - Число - уровень адресного элемента.
//
Процедура ОчиститьПотомковПоУровнюАдресногоЭлемента(Регион, Район, Город, НаселенныйПункт, Улица, 
	Дом, Корпус, Квартира, Уровень) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Определить индекс по переданным региону, району, городу, населенному пункту,
// улице, дому и корпусу
//
// Параметры: 
//  НазваниеРегиона - название региона( с сокращением)
//  НазваниеРайона - название района( с сокращением)
//  НазваниеГорода - название города( с сокращением)
//  НазваниеНаселенногоПункта - название населенного пункта( с сокращением)
//  Улица - название улицы ( с сокращением)
//  НомерДома - номер дома, для которого необходимо получить индекс
//  НомерКорпуса - номер корпуса
//  РодительИндекса - переменная, в которую сохраняется структура найденого адресного элемента
//
// Возвращаемое значение:
//  Строка - шестизначный почтовый индекс
//
Функция ПолучитьИндекс(Знач НазваниеРегиона, Знач НазваниеРайона, Знач НазваниеГорода, Знач НазваниеНаселенногоПункта, 
	Знач НазваниеУлицы, Знач НомерДома, Знач НомерКорпуса, РодительИндекса = Неопределено) Экспорт
	
	Возврат "";

КонецФункции

// Обработчик автоподбора в адресном элементе ввода.
//
// Параметры: 
//  Текст  - Строка - введенный пользователем текст в адресном элементе ввода
//  Регион - Строка - ранее введенное название региона
//  Район  - Строка - ранее введенное название района
//  Город  - Строка - ранее введенное название города
//  НаселенныйПункт - Строка - ранее введенное название населенного пункта
//  УровеньЭлемента - Число - идентификатор адресного элемента ввода.
//                            1 - регион, 2 - район, 3 - город, 4 - населенный пункт, 5 - улица, 0 - прочее.
//	ПризнакАктуальности - Число - признак актуальности элемента.
//
// Возвращаемое значение:
//  СписокЗначений; Неопределено
//
Функция АвтоПодборТекстВАдресномЭлементе(Текст, Регион, Район, Город, НаселенныйПункт, УровеньЭлемента,
	ПризнакАктуальности = 0) Экспорт
	
	Возврат "";
	
КонецФункции

// Проверяет соответствие адреса КЛАДРу по переданным индексу, региону, району, городу, населенному пункту,
// улице, дому и корпусу, при этом выводит все поля по каждому найденому элементу адреса
//
// Параметры: 
//  УказанныйИндекс - Строка - индекс
//  НазваниеРегиона - Строка - название региона(с сокращением)
//  НазваниеРайона - Строка - название района(с сокращением)
//  НазваниеГорода - Строка - название города(с сокращением)
//  НазваниеНаселенногоПункта - Строка - название населенного пункта(с сокращением)
//  НазваниеУлицы - Строка - название улицы(с сокращением)
//  НомерДома - Строка - номер дома, для которого необходимо получить индекс
//  НомерКорпуса - Строка - номер корпуса
//
// Возвращаемое значение:
//  Структура с полями:
//		Регион - Структура - структура полей найденого региона
//		Район - Структура - структура полей найденого района
//		Город - Структура - структура полей найденого города
//		НаселенныйПункт - Структура - структура полей найденого населенного пункта
//		Улица - Структура - структура полей найденой улицы
//		Дом - Структура - структура полей найденого дома
//		ЕстьОшибки - Булево - найдены ли ошибки при проверке
//		СтруктураОшибок - Структура - структура в которой в качестве ключа выступает название элемента
//			а в качестве значения - подробный текст ошибки.
//
Функция ПроверитьСоответствиеАдресаКЛАДРу(Знач УказанныйИндекс = "", Знач НазваниеРегиона = "", Знач НазваниеРайона = "", 
	Знач НазваниеГорода = "", Знач НазваниеНаселенногоПункта = "", Знач НазваниеУлицы = "", Знач НомерДома = "", 
	Знач НомерКорпуса = "") Экспорт
	
	Возврат "";
	
КонецФункции

// Проверяет загружен ли адресный элемент в базу.
//
// Параметры: 
//  НазваниеРегиона - Строка - название региона(с сокращением)
//  НазваниеРайона - Строка - название района(с сокращением)
//  НазваниеГорода - Строка - название города(с сокращением)
//  НазваниеНаселенногоПункта - Строка - название населенного пункта(с сокращением)
//  НазваниеУлицы - Строка - название улицы(с сокращением)
//  Уровень - Число - уровень, который нужно проверить на загруженность
//
// Возвращаемое значение:
//  Булево - Истина, если адресный элемент загружен, Ложь - в противном случае.
//
Функция АдресныйЭлементЗагружен(Знач НазваниеРегиона, Знач НазваниеРайона = "", Знач НазваниеГорода = "", 
	Знач НазваниеНаселенногоПункта = "", Знач НазваниеУлицы = "", Уровень = 1) Экспорт
	
	Возврат "";
	
КонецФункции

// По полному наименованию адресного элемента выдает отдельно его имя, и отдельно его адресное сокращение
//
// Параметры:
//	СтрокаЭлемента - Строка - строка элемента.
//	АдресноеСокращение - Строка - адресное сокращение.
//
// Возвращаемое значение:
//	Строка - имя и адресное сокращение.
//
Функция ПолучитьИмяИАдресноеСокращение(Знач СтрокаЭлемента, АдресноеСокращение) Экспорт

	Возврат "";

КонецФункции

// По переданным элементам адреса указывает, загружен ли КЛАДР по соответствующим элементам. 
//
// Параметры: 
//  НазваниеРегиона - Строка - название региона(с сокращением)
//  НазваниеРайона - Строка - название района(с сокращением)
//  НазваниеГорода - Строка - название города(с сокращением)
//  НазваниеНаселенногоПункта - Строка - название населенного пункта(с сокращением)
//  НазваниеУлицы - Строка - название улицы(с сокращением)
//
// Возвращаемое значение:
//  Структура с полями:
//  Регион - Булево - регион загружен
//  Район - Булево - район загружен
//  Город - Булево - город загружен
//  НаселенныйПункт - населенный пункт загружен
//  Улица - Булево - улица загружена
//
Функция СтруктураЗагруженныхЭлементовАдреса(Знач НазваниеРегиона, Знач НазваниеРайона, Знач НазваниеГорода,
	Знач НазваниеНаселенногоПункта, Знач НазваниеУлицы) Экспорт

	Возврат "";
		
КонецФункции

// По переданным элементам адреса указывает, загружен ли КЛАДР по соответствующим элементам. 
//
// Параметры: 
//	КодАдресногоЭлемента - Число - код адресного элемента, по которому ищутся компоненты адреса 
//	Дом - Строка - номер дома, если требуется
//	Корпус - Строка - номер корпуса, если требуется
//	Квартира - Строка - номер квартиры, если требуется
//
// Возвращаемое значение:
//  Структура с полями:
//		Индекс - Строка - индекс адреса по переданным параметрам
//		Регион - Строка - регион по переданному коду
//		Район - Строка - район по переданному коду
//		Город - Строка - город по переданному коду
//		НаселенныйПункт - Строка - населенный пункт по переданному коду
//		Улица - Строка - улица по переданному коду
//		Дом - Строка - переданный номер дома
//		Корпус - Строка - переданный номер корпуса
//		Квартира - Строка - переданный номер квартиры
//
Функция ПолучитьСтруктуруАдресаНаСервере(КодАдресногоЭлемента, Дом = "", Корпус = "", Квартира = "") Экспорт
	
	Возврат "";
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
