
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если РаботаСоСканеромКлиент.ПроинициализироватьКомпоненту() Тогда
		
		МассивУстройств = РаботаСоСканеромКлиент.ПолучитьУстройства();
		Для Каждого Строка Из МассивУстройств Цикл
			Элементы.ИмяУстройства.СписокВыбора.Добавить(Строка);
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	МассивСтруктур = Новый Массив;
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;
	
	Элемент = Новый Структура;
	Элемент.Вставить("Объект", "НастройкиСканирования/ИмяУстройства");
	Элемент.Вставить("Настройка", ИдентификаторКлиента);
	Элемент.Вставить("Значение", ИмяУстройства);
	МассивСтруктур.Добавить(Элемент);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранитьМассивИОбновитьПовторноИспользуемыеЗначения(МассивСтруктур);
	Закрыть(Элемент);
	
КонецПроцедуры
