
Процедура ЗаполнитьЗначениеРеквизитаУпорядочивания(Источник, Отказ) 
	Если Источник.ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;		
	
	// Если в обработчике был установлен отказ новый порядок не вычисляем
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//// Вычислим новое значение для порядка элемента
	//Если ЗначениеЗаполнено(Источник.Родитель) Тогда
	//	Источник.РеквизитДопУпорядочивания = ПолучитьПорядокЭлементов(Информация,Источник.Родитель);
	//Иначе
	//	Источник.РеквизитДопУпорядочивания = ПолучитьПорядокЭлементов(Информация,Справочники.РазделыБазыЗнаний.ПустаяСсылка());	
	//КонецЕсли;
КонецПроцедуры

Функция ПолучитьПорядокЭлементов(Информация,ТекРодитель)
	//УстановитьПривилегированныйРежим(Истина);
	//
	//Запрос = Новый Запрос();
	//
	//УсловияЗапроса = Новый Массив;
	//
	//Если Информация.ЕстьРодитель Тогда
	//	УсловияЗапроса.Добавить("Таблица.Родитель = &Родитель");
	//	Запрос.УстановитьПараметр("Родитель", ТекРодитель);
	//КонецЕсли;
	//	
	//ДополнительныеУсловия = "ИСТИНА";
	//Для Каждого Условие Из УсловияЗапроса Цикл
	//	ДополнительныеУсловия = ДополнительныеУсловия + " И " + Условие;
	//КонецЦикла;
	//
	//ТекстЗапроса =
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Таблица.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
	//|ИЗ
	//|	&Таблица КАК Таблица
	//|ГДЕ
	//|	&ДополнительныеУсловия
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	РеквизитДопУпорядочивания УБЫВ";
	//
	//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Таблица", Информация.ПолноеИмя);
	//ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДополнительныеУсловия", ДополнительныеУсловия);
	//
	//Запрос.Текст = ТекстЗапроса;
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//Выборка.Следующий();
	//
	//СтрокаПорядка = ?(Не ЗначениеЗаполнено(Выборка.РеквизитДопУпорядочивания), 1, Выборка.РеквизитДопУпорядочивания);	
	//
	////Разбираем строку
	//МнСтрПорядка = СтрЗаменить(СтрокаПорядка,".",Символы.ПС);
	//ПоследнийНомер = Число(СтрПолучитьСтроку(МнСтрПорядка, СтрЧислоСтрок(МнСтрПорядка)));
	//
	//НовыйНомер = ПоследнийНомер+1;
	//
	////Формируем новый номер
	//НоваяСтрПорядка = "";
	//НоваяСтрПорядка = Строка(НовыйНомер);
	//Если ЗначениеЗаполнено(ТекРодитель) Тогда 
	//	ТекРодительЭлемента = ТекРодитель;
	//	Пока ЗначениеЗаполнено(ТекРодительЭлемента) Цикл
	//		НоваяСтрПорядка = ТекРодительЭлемента.
	//		ТекРодительЭлемента = ТекРодительЭлемента.Родитель;
	//	КонецЦикла;
	//КонецЕсли;
	//
	//Возврат НоваяСтрПорядка;
КонецФункции

Процедура ПередЗаписью(Отказ)
	ЗаполнитьЗначениеРеквизитаУпорядочивания(ЭтотОбъект,Отказ)
КонецПроцедуры
