
&НаКлиенте
Процедура КартинкаЗагрузкаУчетныхЗаписейНажатие(Элемент)
	ОткрытьФорму("Обработка.ЗагрузкаУчетныхЗаписейИзAD.Форма");	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсториюРаботыПользователейВыполнить()
	ИсторияРаботыПользователя.ОчиститьВсе();
	ПоказатьОповещениеПользователя("", "", "История работы пользователей очищена!");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаУдалениеНажатие(Элемент)
	ОткрытьФорму("Обработка.УдалениеПомеченныхОбъектов.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаППДНажатие(Элемент)
	ОткрытьФорму("Обработка.УправлениеПолнотекстовымПоиском.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаБлокировкаНажатие(Элемент)
	ОткрытьФорму("Обработка.БлокировкаСоединенийСИнформационнойБазой.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаКонсольНажатие(Элемент)
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаПользователиНажатие(Элемент)
	ОткрытьФорму("Обработка.АктивныеПользователи.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНастройкиФормНажатие(Элемент)
	ОткрытьФорму("Обработка.УправлениеНастройкамиФорм.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаЖурналНажатие(Элемент)
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаКонтрольЖурналаНажатие(Элемент)
	ОткрытьФорму("Обработка.КонтрольЖурналаРегистрации.Форма");
КонецПроцедуры

&НаСервере
Функция ПолучитьИспользоватьПолнотекстовыйПоиск()
	УстановитьПривилегированныйРежим(Истина);
	ИспользоватьПолнотекстовыйПоиск = Константы.ИспользоватьПолнотекстовыйПоиск.Получить();
	Возврат ИспользоватьПолнотекстовыйПоиск;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьПолнотекстовыйПоиск = ПолучитьИспользоватьПолнотекстовыйПоиск();
	Элементы.ГруппаППД.Доступность = ИспользоватьПолнотекстовыйПоиск;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПолнотекстовыйПоискИзменен" Тогда
		ИспользоватьПолнотекстовыйПоиск = ПолучитьИспользоватьПолнотекстовыйПоиск();
		Элементы.ГруппаППД.Доступность = ИспользоватьПолнотекстовыйПоиск;
	КонецЕсли;
	
КонецПроцедуры
