
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПараметрПроект = Новый ПараметрКомпоновкиДанных("Проект");
	Для Каждого ЭлементНастройки Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") 
		   И ЭлементНастройки.Параметр = ПараметрПроект
		   И (ЭлементНастройки.Использование = Ложь 
		   Или Не ЗначениеЗаполнено(ЭлементНастройки.Значение)) Тогда 
		   
		   ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		    		НСтр("ru = 'Не указан параметр ""Проект""'"),,
		    		"Отчет.КомпоновщикНастроек.ПользовательскиеНастройки",,Отказ);
		КонецЕсли;   
	КонецЦикла;
	
	ПараметрДолжныНачаться = Новый ПараметрКомпоновкиДанных("ДолжныНачаться");
	Для Каждого ЭлементНастройки Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") 
		   И ЭлементНастройки.Параметр = ПараметрДолжныНачаться
		   И (ЭлементНастройки.Использование = Ложь 
		   Или Не ЗначениеЗаполнено(ЭлементНастройки.Значение)) Тогда 
		   
		   ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		    		НСтр("ru = 'Не указан параметр ""Должны начаться""'"),,
		    		"Отчет.КомпоновщикНастроек.ПользовательскиеНастройки",,Отказ);
		КонецЕсли;   
	КонецЦикла;
	
	ПараметрДолжныЗакончиться = Новый ПараметрКомпоновкиДанных("ДолжныЗакончиться");
	Для Каждого ЭлементНастройки Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") 
		   И ЭлементНастройки.Параметр = ПараметрДолжныЗакончиться
		   И (ЭлементНастройки.Использование = Ложь 
		   Или Не ЗначениеЗаполнено(ЭлементНастройки.Значение)) Тогда 
		   
		   ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		    		НСтр("ru = 'Не указан параметр ""Должны закончиться""'"),,
		    		"Отчет.КомпоновщикНастроек.ПользовательскиеНастройки",,Отказ);
		КонецЕсли;   
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	ПараметрПроект = Новый ПараметрКомпоновкиДанных("Проект"); 
	Для Каждого ЭлементНастроек Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если (ТипЗнч(ЭлементНастроек) =  Тип("ЗначениеПараметраНастроекКомпоновкиДанных"))
		   И (ЭлементНастроек.Параметр = ПараметрПроект) 
		   И ЗначениеЗаполнено(Параметры.Проект) Тогда
 			ЭлементНастроек.Значение = Параметры.Проект;
			ЭлементНастроек.Использование = Истина;
 		КонецЕсли;	
 	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	ПараметрПроект = Новый ПараметрКомпоновкиДанных("Проект"); 
	Для Каждого ЭлементНастроек Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если (ТипЗнч(ЭлементНастроек) =  Тип("ЗначениеПараметраНастроекКомпоновкиДанных"))
		   И (ЭлементНастроек.Параметр = ПараметрПроект) 
		   И ЗначениеЗаполнено(Параметры.Проект) Тогда
 			ЭлементНастроек.Значение = Параметры.Проект;
			ЭлементНастроек.Использование = Истина;
 		КонецЕсли;	
 	КонецЦикла;
	
КонецПроцедуры

