// Делает запись в регистр.
//
Процедура УстановитьФлаг(Письмо, Пользователь, Флаг) Экспорт
	
	Запись = РегистрыСведений.ФлагиПисем.СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Пользователь = Пользователь;
	Запись.Флаг = Флаг;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Очищает запись.
//
Процедура ОчиститьФлаг(Письмо, Пользователь) Экспорт
	
	Запись = РегистрыСведений.ФлагиПисем.СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Пользователь = Пользователь;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// Получает значение ресурса Флаг для измерений регистра Письмо, Пользователь.
//
Функция ПолучитьФлаг(Письмо, Пользователь) Экспорт
	
	Запись = РегистрыСведений.ФлагиПисем.СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Пользователь = Пользователь;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.Флаг;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Если у письма установлен флаг то очищает его,
// иначе устанавливает.
Процедура ПереключитьФлаг(Письмо, Пользователь, Флаг) Экспорт
	
	Запись = РегистрыСведений.ФлагиПисем.СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Пользователь = Пользователь;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	Иначе
		Запись.Письмо = Письмо;
		Запись.Пользователь = Пользователь;
		Запись.Флаг = Флаг;
		Запись.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры
