
Перем СтароеЗначение; // Значение константы до изменения.
//                       Используется в обработчике события ПриЗаписи.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтароеЗначение = УправлениеДоступом.ДобавлятьРуководителямДоступПодчиненных();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если СтароеЗначение <> Значение Тогда
		УправлениеДоступомСлужебный.ПриИзмененииКонстантыДобавлятьРуководителямДоступПодчиненных();
	КонецЕсли;
	
КонецПроцедуры
