////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ КЛИЕНТСКИЕ ПРОЦЕДУРЫ ПОДСИСТЕМЫ "ВАРИАНТЫ ОТЧЕТОВ"

// Открывает панель отчетов. Используется в модуле общей команды.
//
// Параметры:
//		Подсистемы                 - строка с путем к подсистеме
//		НазваниеФормы              - заголовок панели отчетов должен соответствовать представление команды
//      ПараметрыВыполненияКоманды - Параметры выполнения команды
//		КартинкаФормы              - картинка возле заголовка панели.
//
Процедура ОткрытьПанельОтчетов(Подсистемы, НазваниеФормы, ПараметрыВыполненияКоманды, 
	КартинкаФормы = Неопределено) Экспорт
	
	ИмяФормы = "ОбщаяФорма.ПанельОтчетов";
	
	Параметры = Новый Структура("Подсистемы, ИмяФормы, КартинкаФормы");
	Параметры.Подсистемы    = Подсистемы;
	Параметры.ИмяФормы      = НазваниеФормы;
	Параметры.КартинкаФормы = КартинкаФормы;
	
	Владелец = ПараметрыВыполненияКоманды.Источник;
	
	Уникальность = ПараметрыВыполненияКоманды.Уникальность;
	Если ТипЗнч(Владелец) = Тип("ОкноКлиентскогоПриложения") И Владелец.Основное = Истина Тогда
		Уникальность = Подсистемы +"."+ СтрЗаменить(ТРег(НазваниеФормы), " ", "") +"."+ Уникальность;
	КонецЕсли;
	
	Окно = ПараметрыВыполненияКоманды.Окно;
	
	ОткрытьФорму(ИмяФормы, Параметры, Владелец, Уникальность, Окно); 
	
КонецПроцедуры


// Восстанавливает из строки СтрокаДляЗамены запрещенные символы в именах элементов формы.
//
Функция ВосстановитьЗапрещенныеСимволы(Знач СтрокаДляЗамены) Экспорт
	
	СтрокаРезультат = СтрокаДляЗамены;
	
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Точка_", ".");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Зап_", ",");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Слэш_", "\");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Тирэ_", "-");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_П_", " ");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Воскл_", "!");
	
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Соб_", "@");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Ном_", "№");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Проц_", "%");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Реш_", "#");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Дол_", "$");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Степ_", "^");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Анд_", "&");
	
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ТЗап_", ";");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ДвТ_", ":");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Воп_", "?");
   	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Звезд_", "*");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ОСк_", "(");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ЗСк_", ")");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Рав_", "=");

	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Вол_", "~");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Ап_", "`");
	
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ОФС_", "{");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ЗФС_", "{");
	
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ОКС_", "[");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ЗКС_", "[");
	
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Кав_", """");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ОКав_", "'");
	
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Пал_", "|");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ПСл_", "\");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_ОСл_", "/");
	
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Бол_", ">");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "_Мен_", "<");
	
	Возврат СтрокаРезультат;
	
КонецФункции


// Возвращает параметры дополнительной команды.
//
// Параметры:
//		ЗначениеПараметровКоманд - таблица из формы "Панель отчетов" или "Все отчеты".
//		МассивПараметровКомманд  - ФиксированныйМассив -из формы "Все отчеты" или "Панель отчетов"
//		Ключ                     - Строка - уникальный ключ команды
//
Функция ПолучитьПараметрыКоманды(ЗначениеПараметровКоманд, МассивПараметровКоманд, Ключ) Экспорт
	
	Для Каждого СтрокаПараметра из ЗначениеПараметровКоманд Цикл
		Если СтрокаПараметра.Ключ = Ключ Тогда
			Возврат МассивПараметровКоманд[СтрокаПараметра.ИндексПозицииЭлемента];
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
	
КонецФункции

