&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("РазделыПоиска", Объект.РазделыПоиска);
	
	СписокСтандартныхРазделов = Новый СписокЗначений;
	Для каждого Элемент Из ПолнотекстовыйПоискСерверПереопределяемый.ПолучитьНаименованияСтандартныхРазделовПоиска() Цикл
		СписокСтандартныхРазделов.Добавить(Элемент);
	КонецЦикла;
	УсловноеОформление.Элементы[0].Отбор.Элементы[0].ПравоеЗначение = СписокСтандартныхРазделов;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элемент.ТекущаяСтрока;
	
	Данные = Объект.РазделыПоиска.НайтиПоИдентификатору(ТекСтрока);
	Если ПолнотекстовыйПоискСерверПереопределяемый.ЭтоСтандартныйРазделПоиска(Данные.Представление) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Нельзя редактировать стандартный раздел поиска'"));
		Возврат;
	КонецЕсли;
	
	ПараметрРаздел = Данные.Значение;
	ПараметрНаименование = Данные.Представление;
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Раздел", ПараметрРаздел);
	ПараметрыОткрытия.Вставить("Наименование", ПараметрНаименование);
	Результат = Неопределено;

	ОткрытьФорму("Обработка.ПолнотекстовыйПоискВДанных.Форма.ФормаРазделаПоиска", ПараметрыОткрытия,,,,, Новый ОписаниеОповещения("РазделыПоискаВыборЗавершение", ЭтотОбъект, Новый Структура("ТекСтрока", ТекСтрока)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыПоискаВыборЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	ТекСтрока = ДополнительныеПараметры.ТекСтрока;
	
	
	Результат = Результат1;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.РазделыПоиска.НайтиПоИдентификатору(ТекСтрока).Значение = Результат.Раздел;
	Объект.РазделыПоиска.НайтиПоИдентификатору(ТекСтрока).Представление = Результат.Наименование;

КонецПроцедуры

&НаКлиенте
Процедура РазделыПоискаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	ПараметрОткрытия = Новый Структура;
	Если Копирование Тогда
		ПараметрОткрытия.Вставить("Наименование", Элемент.ТекущиеДанные.Представление);
		ПараметрОткрытия.Вставить("Раздел", Элемент.ТекущиеДанные.Значение);
	Иначе
		ПараметрОткрытия.Вставить("Наименование", НСтр("ru = 'Новый раздел '") + ТекущаяДата());
		ПараметрОткрытия.Вставить("Раздел", Новый Массив);
	КонецЕсли;
	Результат = Неопределено;

	ОткрытьФорму("Обработка.ПолнотекстовыйПоискВДанных.Форма.ФормаРазделаПоиска", ПараметрОткрытия,,,,, Новый ОписаниеОповещения("РазделыПоискаПередНачаломДобавленияЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыПоискаПередНачаломДобавленияЗавершение(Результат1, ДополнительныеПараметры) Экспорт
	
	Результат = Результат1;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.РазделыПоиска.Добавить(Результат.Раздел, Результат.Наименование);

КонецПроцедуры

&НаКлиенте
Процедура РазделыПоискаПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.Имя = "РазделыПоискаЗначение" Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Закрыть(Объект.РазделыПоиска);
КонецПроцедуры

&НаКлиенте
Процедура РазделыПоискаПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элемент.ТекущаяСтрока;
	Данные = Объект.РазделыПоиска.НайтиПоИдентификатору(ТекСтрока);
	Если ПолнотекстовыйПоискСерверПереопределяемый.ЭтоСтандартныйРазделПоиска(Данные.Представление) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Нельзя удалять стандартные разделы поиска'"));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
