// Находит максимальный порядок среди томов
&НаСервере
Функция НайтиМаксимальныйПорядок()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	МАКСИМУМ(Тома.ПорядокЗаполнения) КАК МаксимальныйНомер
				   |ИЗ
				   |	Справочник.ТомаХраненияФайлов КАК Тома";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.МаксимальныйНомер = Null Тогда
			Возврат 0;
		Иначе
			Возврат Число(Выборка.МаксимальныйНомер);
		КонецЕсли;		
	КонецЕсли;
	
	Возврат 0;
КонецФункции // НайтиМаксимальныйПорядок

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПорядокЗаполнения = НайтиМаксимальныйПорядок() + 1;
	КонецЕсли;
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Элементы.ПолныйПутьLinux.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.ПолныйПутьWindows.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		
		ТекущийРазмерВБайтах = 0;
		
		СтандартныеПодсистемыПереопределяемый.ПодсчитатьРазмерФайловНаТоме(
			Объект.Ссылка, ТекущийРазмерВБайтах);
			
		ТекущийРазмер = ТекущийРазмерВБайтах / (1024 * 1024);
		Если ТекущийРазмер = 0 И ТекущийРазмерВБайтах <> 0 Тогда
			ТекущийРазмер = 1;
		КонецЕсли;
	КонецЕсли;
	
	ТипПлатформыСервера = ОбщегоНазначенияПовтИсп.ТипПлатформыСервера();
	
	Если ТипПлатформыСервера = ТипПлатформы.Windows_x86 ИЛИ ТипПлатформыСервера = ТипПлатформы.Windows_x86_64 Тогда
		Элементы.ПолныйПутьWindows.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.ПолныйПутьLinux.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Добавляем слэш в конце, если его нет
	Если Не ПустаяСтрока(Объект.ПолныйПутьWindows) Тогда
		Если Прав(Объект.ПолныйПутьWindows, 1) <> "\" Тогда
			Объект.ПолныйПутьWindows = Объект.ПолныйПутьWindows + "\";
		КонецЕсли;
		
		Если Прав(Объект.ПолныйПутьWindows, 2) = "\\" Тогда
			Объект.ПолныйПутьWindows = Лев(Объект.ПолныйПутьWindows, СтрДлина(Объект.ПолныйПутьWindows) - 1);
		КонецЕсли;
	КонецЕсли;
	
	// Добавляем слэш в конце, если его нет
	Если Не ПустаяСтрока(Объект.ПолныйПутьLinux) Тогда
		Если Прав(Объект.ПолныйПутьLinux, 1) <> "\" Тогда
			Объект.ПолныйПутьLinux = Объект.ПолныйПутьLinux + "\";
		КонецЕсли;
		
		Если Прав(Объект.ПолныйПутьLinux, 2) = "\\" Тогда
			Объект.ПолныйПутьLinux = Лев(Объект.ПолныйПутьLinux, СтрДлина(Объект.ПолныйПутьLinux) - 1);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
