
&НаКлиенте
Процедура ОтчетВыбор(Элемент, Область, СтандартнаяОбработка)
	
#Если Не ВебКлиент Тогда
	// Путь к файлу.
	Если Найти(Область.Текст, ":\") > 0 ИЛИ Найти(Область.Текст, ":/") > 0 Тогда
		ФайловыеФункцииСлужебныйКлиент.ОткрытьПроводникСФайлом(Область.Текст);
	КонецЕсли;
#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Отчет = РаботаСФайламиВызовСервера.ИмпортФайловСформироватьОтчет(Параметры.МассивИменФайловСОшибками);
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
КонецПроцедуры
