#Область ПеременныеФормы

&НаКлиенте
Перем ТекущийЭлементЦвета;

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоОрганизациям") Тогда
		ИспользоватьУчетПоОрганизациям = Истина;
	Иначе
		ИспользоватьУчетПоОрганизациям = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ПулЗаявокОрганизация.Видимость = ИспользоватьУчетПоОрганизациям;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОбработкаОжидания", 600);
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжидания()
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок()
	Элементы.ПулЗаявок.Обновить();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ПулЗаявокПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.ПулЗаявок.ТекущаяСтрока;
	Если ТекСтрока <> Неопределено И ТипЗнч(ТекСтрока) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Элементы.НазначитьЗаявку.Доступность = Истина;
	Иначе
		Элементы.НазначитьЗаявку.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПереместитьЗаявкуНаПользователя(МассивЗаявок,НовыйИсполнитель)	
	Если Не ЗначениеЗаполнено(НовыйИсполнитель) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Заявка из МассивЗаявок Цикл
		Если ТипЗнч(Заявка) = Тип("ДокументСсылка.Заявка") Тогда
			ЗаявкаОбъект = Заявка.ПолучитьОбъект();
			ЗаявкаОбъект.ТекущийИсполнитель = НовыйИсполнитель;
			ЗаявкаОбъект.Записать();
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПользователяДляЗаявки(МассивСтрок) 
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Пользователи"));
	ОписаниеТиповПользователи = Новый ОписаниеТипов(Массив);
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ПолучитьПользователяДляЗаявкиЗавершение", ЭтотОбъект, Новый Структура("МассивСтрок",МассивСтрок)),ПользователиКлиентСервер.ТекущийПользователь(), "Выберите пользователя", ОписаниеТиповПользователи);
КонецПроцедуры	

&НаКлиенте
Процедура НазначитьЗаявку(Команда)
	МассивСтрок = Элементы.ПулЗаявок.ВыделенныеСтроки;
	Если МассивСтрок.Количество() <> 0 Тогда
		ПолучитьПользователяДляЗаявки(МассивСтрок);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура  ПолучитьПользователяДляЗаявкиЗавершение(Значение, ДополнительныеПараметры) Экспорт
	МассивСтрок =  ДополнительныеПараметры.МассивСтрок;
	ПереместитьЗаявкуНаПользователя(МассивСтрок,Значение);
КонецПроцедуры