// Вызывается перед нажатием на команду открытия варианта отчета. 
//
// Параметры
//   Ключ                 - Строка    - ключ варианта отчета
//   ПараметрыФормы       - Структура - параметры формы отчета
//   СтандартнаяОбработка - Булево    - по умолчанию Истина. Если Истина, то подсистема откроет форму отчета.
//
Процедура ПередОткрытиемФормыОтчета(Ключ, ПараметрыФормы, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается, когда требуется выполнить внешнюю команду для интеграции с другими подсистемами.
//
// Параметры
//   УникальныйИдентификатор - Строка - ключ варианта отчета
//   ПараметрКоманды         - произвольный тип - параметры внешней команды
//
Процедура ВыполнитьВнешнююКоманду(УникальныйИдентификатор, ПараметрКоманды) Экспорт
	
КонецПроцедуры
