// Удаляет из регистра запись об не полученном входящем письме.
// Вызывается при успешном получении письма или если письмо отсутствует в почтовом ящике.
//
Процедура ОчиститьИнформацию(УчетнаяЗапись, Идентификатор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.НеПолученныеВходящиеПисьма.СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.Идентификатор = Идентификатор;
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// Добавляет в регистр запись об не полученном вхоящем письме,
// если запись уже есть, то уменьшает оставщееся количество
// попыток получения.
Процедура НеуспешнаяПопыткаПолучения(УчетнаяЗапись, Идентификатор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.НеПолученныеВходящиеПисьма.СоздатьМенеджерЗаписи();
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.Идентификатор = Идентификатор;
	Если Не Запись.Выбран() Тогда
		Запись.ОтсталосьПопытокПолучения = 3;
		Запись.Записать(Истина);
	КонецЕсли;
	
	Запись.ОтсталосьПопытокПолучения = Запись.ОтсталосьПопытокПолучения - 1;
	Запись.Записать(Истина);
	
КонецПроцедуры
