////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Возврат при получении формы для анализа.
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СкрытыеВидыДоступа = Новый СписокЗначений;
	
	Отбор = Новый Структура("ВидДоступаИспользуетсяВсегда", Истина);
	ВидыДоступаИспользуемыеВсегдаСвойства = УправлениеДоступомСлужебный.СвойстваВидаДоступа().НайтиСтроки(Отбор);
	
	Для каждого СвойстваВидаДоступа Из ВидыДоступаИспользуемыеВсегдаСвойства Цикл
		
		СкрытыеВидыДоступа.Добавить(СвойстваВидаДоступа.ВидДоступа);
	КонецЦикла;
	
	Если НЕ ВнешниеПользователи.ИспользоватьВнешнихПользователей() Тогда
		
		СкрытыеВидыДоступа.Добавить(ПланыВидовХарактеристик.ВидыДоступа.ВнешниеПользователи);
	КонецЕсли;
	
	Список.Отбор.Элементы[0].ПравоеЗначение = СкрытыеВидыДоступа;
	
КонецПроцедуры
