////////////////////////////////////////////////////////////////////////////////
// Подсистема "Напоминания пользователя".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Переопределяет массив реквизитов объекта, относительно которых разрешается устанавливать время напоминания.
// Например, можно скрыть те реквизиты с датами, которые являются служебными или не имеют смысла для 
// установки напоминаний: дата документа или задачи и прочие.
// 
// Параметры
//  Источник	 - Любая ссылка - Ссылка на объект, для которого формируется массив реквизитов с датами
//  МассивРеквизитов - Массив - Массив имён реквизитов (из метаданных), содержащих даты
//
Процедура ПриЗаполненииСпискаРеквизитовИсточникаСДатамиДляНапоминания(Источник, МассивРеквизитов) Экспорт
	
КонецПроцедуры

// Переопределяет варианты расписаний для выбора пользователем.
//
// Параметры:
//  Расписания - Соответствие:
//                Ключ     - Строка - представление расписания;
//                Значение - РасписаниеРегламентногоЗадания - вариант расписания.
Процедура ПриПолученииСтандартныхРасписанийДляНапоминания(Расписания) Экспорт
	
КонецПроцедуры


