
&НаКлиенте
Процедура ИмяВариантаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КлючОбъекта", Общегоназначения.ПолучитьЗначениеРеквизита(Запись.ИмяОтчета,"ПолноеИмя"));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
 
	ОткрытьФорму("Справочник.ВариантыОтчетов.Форма.ВыборВариантаОтчета", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИмяОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ФН = Новый НастройкиКомпоновкиДанных;
	Эл = ФН.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение = ПредопределенноеЗначение("Справочник.ИдентификаторыОбъектовМетаданных.Отчеты");
	Эл.Использование = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", ФН);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Запись.ИмяОтчета);
	ПараметрыФормы.Вставить("ЗакрыватьПослеВыбора", Истина);
	ФормаВыбора = ПолучитьФорму("Справочник.ИдентификаторыОбъектовМетаданных.ФормаВыбора", ПараметрыФормы,Элемент);
	
	ФормаВыбора.Элементы.Список.Отображение  = ОтображениеТаблицы.Список;
	
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Запись.ИмяВарианта = ВыбранноеЗначение.Отчет;
КонецПроцедуры
