////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Сообщение") Тогда
		Если Параметры.Сообщение <> Неопределено Тогда
			Элементы.ДекорацияПояснение.Заголовок = Параметры.Сообщение + Символы.ПС + НСтр("ru = ' Установить и подключить?'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура НеУстанавливать(Команда)
	Закрыть(Ложь); // не предлагать
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПозже(Команда)
	Закрыть(Истина); // предлагать позже  - в другом сеансе
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСейчас(Команда)
	
	НачатьУстановкуРасширенияРаботыСФайлами(Новый ОписаниеОповещения("УстановитьСейчасЗавершение1", ЭтотОбъект));	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСейчасЗавершение1(ДополнительныеПараметры) Экспорт
	
	РасширениеПодключено = Неопределено;
	
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("УстановитьСейчасЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСейчасЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	РасширениеПодключено = Подключено;
	Если НЕ РасширениеПодключено Тогда
		Закрыть(Истина); // предлагать позже  - в другом сеансе
	Иначе	
		Закрыть(Ложь); // не предлагать
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть(Истина); // предлагать позже  - в другом сеансе
КонецПроцедуры
