
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.НачПериода = НачалоМесяца(ТекущаяДата());
	Отчет.КонПериода = КонецМесяца(ТекущаяДата());

	НастроитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы()
	Настройки = Отчет.КомпоновщикНастроек.Настройки; 
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНач",НачалоДня(Отчет.НачПериода));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКон",КонецДня(Отчет.КонПериода));
	ВариантМодифицирован = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НачПериодаПриИзменении(Элемент)
	НастроитьОтборы();
КонецПроцедуры

&НаКлиенте
Процедура КонПериодаПриИзменении(Элемент)
	НастроитьОтборы();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	ТекНастройки = Отчет.КомпоновщикНастроек.Настройки; 
	ТекНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНач",НачалоДня(Отчет.НачПериода));
	ТекНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКон",КонецДня(Отчет.КонПериода));
КонецПроцедуры


