
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	//Если СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента(
	//		).УпрощенныйИнтерфейсНастройкиПравДоступа Тогда
	//	
	//	ИмяФормы = "ОбщаяФорма.ПраваДоступаУпрощенно";
	//Иначе
	//	ИмяФормы = "ОбщаяФорма.ПраваДоступа";
	//КонецЕсли;
	ИмяФормы = "ОбщаяФорма.ПраваДоступаУпрощенно";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Пользователь", ПараметрКоманды);
	
	ОткрытьФорму(
		ИмяФормы,
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
