////////////////////////////////////////////////////////////////////////////////
// Подсистема "Файловые функции".
//
////////////////////////////////////////////////////////////////////////////////

// Возвращает форму, которая используется для информирования
// пользователей об особенностях заема и редактирования файлов
// в веб-клиенте.
//
Функция ПолучитьФормуНапоминанияПриРедактировании() Экспорт
	
	Возврат ПолучитьФорму("ОбщаяФорма.НапоминаниеПриРедактировании");
	
КонецФункции

// Возвращает СписокРасширенийФайловOpenDocument.
Функция ПолучитьСписокРасширенийФайловOpenDocument() Экспорт
	
	Возврат ФайловыеФункцииСлужебныйВызовСервера.ПолучитьСписокРасширенийФайловOpenDocument();
	
КонецФункции

// Возвращает СписокРасширенийТекстовыхФайлов.
Функция ПолучитьСписокРасширенийТекстовыхФайлов() Экспорт
	
	Возврат ФайловыеФункцииСлужебныйВызовСервера.ПолучитьСписокРасширенийТекстовыхФайлов();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает структуру, содержащую различные персональные настройки.
Функция ПолучитьПерсональныеНастройкиРаботыСФайлами() Экспорт
	
	ПерсональныеНастройки = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента(
		).ПерсональныеНастройкиРаботыСФайлами;
	
	// Проверка и обновление настроек сохраненных на сервере,
	// которые вычисляются на клиенте.
	
	Возврат ПерсональныеНастройки;
	
КонецФункции

// Возвращает параметр сеанса ПутьКРабочемуКаталогуПользователя.
Функция ПолучитьРабочийКаталогПользователя() Экспорт
	
	ИмяКаталога = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента(
		).ПерсональныеНастройкиРаботыСФайлами.ПутьКЛокальномуКэшуФайлов;
		
		//Проверим существование указанного каталога
		//Т.к. настройки общие, а клиенты разные (тонкий и веб) то при одновременной работе можем получить разногласия
	Попытка
		СоздатьКаталог(ИмяКаталога);
		ИмяКаталогаТестовое = ИмяКаталога + "ПроверкаДоступа\";
		СоздатьКаталог(ИмяКаталогаТестовое);
		УдалитьФайлы(ИмяКаталогаТестовое);
	Исключение
		ИмяКаталога = Неопределено;
	КонецПопытки;	
		
	// Уже установлен.
	Если ИмяКаталога <> Неопределено
	   И НЕ ПустаяСтрока(ИмяКаталога)
	   И ПроверкаДоступаКРабочемуКаталогуВыполнена = Истина Тогда
		
		Возврат ИмяКаталога;
	КонецЕсли;
	
	Если ИмяКаталога = Неопределено Тогда
		ИмяКаталога = ФайловыеФункцииСлужебныйКлиент.ВыбратьПутьККаталогуДанныхПользователя();
		Если НЕ ПустаяСтрока(ИмяКаталога) Тогда
			ФайловыеФункцииСлужебныйКлиент.УстановитьРабочийКаталогПользователя(ИмяКаталога);
		Иначе
			ПроверкаДоступаКРабочемуКаталогуВыполнена = Истина;
			Возврат ""; // Веб клиент без расширения работы с файлами.
		КонецЕсли;
	КонецЕсли;
	
#Если НЕ ВебКлиент Тогда
	
	// Создать каталог для файлов.
	Попытка
		СоздатьКаталог(ИмяКаталога);
		ИмяКаталогаТестовое = ИмяКаталога + "ПроверкаДоступа\";
		СоздатьКаталог(ИмяКаталогаТестовое);
		УдалитьФайлы(ИмяКаталогаТестовое);
	Исключение
		// Нет прав на создание каталога, или такой путь отсутствует,
		// тогда установка настроек по умолчанию.
		ИмяКаталога = ФайловыеФункцииСлужебныйКлиент.ВыбратьПутьККаталогуДанныхПользователя();
		ФайловыеФункцииСлужебныйКлиент.УстановитьРабочийКаталогПользователя(ИмяКаталога);
	КонецПопытки;
	
#КонецЕсли
	
	ПроверкаДоступаКРабочемуКаталогуВыполнена = Истина;
	
	Возврат ИмяКаталога;
	
КонецФункции

Функция ПроверитьСуществованиеКаталога(ПутьККаталогу,ОписаниеОшибки) Экспорт
	ЕстьКаталог = Истина;
	ОписаниеОшибки = "";
	// Создать каталог для файлов
	Попытка
		СоздатьКаталог(ПутьККаталогу);
		ИмяКаталогаТестовое = ПутьККаталогу + "ПроверкаДоступа\";
		СоздатьКаталог(ИмяКаталогаТестовое);
		УдалитьФайлы(ИмяКаталогаТестовое);
	Исключение
		// нет прав на создание каталога, или такой путь отсутствует
		
		ОписаниеОшибки 
		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неверный путь или отсутствуют права на запись в каталог ""%1""'"),
		ПутьККаталогу);
		ЕстьКаталог = Ложь;
	КонецПопытки;
	Возврат ЕстьКаталог;
КонецФункции	