
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр НачисленияПоПроектам 
	Движения.НачисленияПоПроектам.Записывать = Истина;
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.НачисленияПоПроектам.Добавить();
		Движение.Период = НачалоДня(ПериодРегистрации);
		Движение.Проект = ТекСтрокаНачисления.Проект;
		Движение.ПроектнаяЗадача = ТекСтрокаНачисления.ПроектнаяЗадача;
		Движение.Источник = ТекСтрокаНачисления.Источник;
		Движение.ВидРабот = ТекСтрокаНачисления.ВидРабот;
		Движение.Пользователь = Сотрудник;
		Движение.Роль = ТекСтрокаНачисления.Роль;
		Движение.ОплаченноеВремя = ТекСтрокаНачисления.НачисленоЧасов*3600;
		Движение.Сумма = ТекСтрокаНачисления.Начислено;
	КонецЦикла;
	
	
	Для Каждого ТекСтрокаНачисления Из НачисленияПоЗакрытымЗаявкам Цикл
		Движение = Движения.НачисленияПоПроектам.Добавить();
		Движение.Период = НачалоДня(ПериодРегистрации);
		Движение.Проект = ТекСтрокаНачисления.Проект;
		Движение.ПроектнаяЗадача = ТекСтрокаНачисления.ПроектнаяЗадача;
		Движение.Источник = ТекСтрокаНачисления.Источник;
		Движение.ВидРабот = ТекСтрокаНачисления.ВидРабот;
		Движение.Пользователь = Сотрудник;
		Движение.Роль = ТекСтрокаНачисления.Роль;
		Движение.ОплаченноеВремя = ТекСтрокаНачисления.НачисленоЧасов*3600;
		Движение.Сумма = ТекСтрокаНачисления.Начислено;
	КонецЦикла;

КонецПроцедуры
