////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	
	РедактируемыеРеквизиты.Добавить("ДоговорПоУмолчанию");
	РедактируемыеРеквизиты.Добавить("Партнер");
	РедактируемыеРеквизиты.Добавить("ЮрФизЛицо");
	РедактируемыеРеквизиты.Добавить("Родитель");
	
	Возврат РедактируемыеРеквизиты;
	
КонецФункции
