
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Информация = Параметры.Информация;
	Заголовок =  Параметры.Заголовок;
КонецПроцедуры

&НаКлиенте
Процедура Да(Команда)
	СтруктураВозврата = Новый Структура("ПрименитьКоВсем, КодВозврата", 
		ПрименитьКоВсем, КодВозвратаДиалога.Да);
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Нет(Команда)
	СтруктураВозврата = Новый Структура("ПрименитьКоВсем, КодВозврата", 
		ПрименитьКоВсем, КодВозвратаДиалога.Нет);
	Закрыть(СтруктураВозврата);
КонецПроцедуры
