// Процедура записывает новую настройку пользователя.
//
Процедура УстановитьНастройкуПользователя(ЗначениеНастройки, ИмяНастройки, Пользователь = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		
		Пользователь = Пользователи.АвторизованныйПользователь();
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();

	НаборЗаписей.Отбор.Пользователь.Использование	= Истина;
	НаборЗаписей.Отбор.Пользователь.Значение		= Пользователь;
	НаборЗаписей.Отбор.Настройка.Использование		= Истина;
	НаборЗаписей.Отбор.Настройка.Значение			= ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки];

	Запись = НаборЗаписей.Добавить();

	Запись.Пользователь	= Пользователь;
	Запись.Настройка	= ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки];
	Запись.Значение		= ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройки].ТипЗначения.ПривестиЗначение(ЗначениеНастройки);
	
	НаборЗаписей.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры // УстановитьНастройкуПользователя()
