
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
      
    ДокументРезультат.Очистить();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
    СхемаКомпоновкиДанных = Отчеты.ДиаграммаСгоранияЗаявок.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;

    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕДЕЛЯ", ?(ТипОтчета=0,"ДЕНЬ","НЕДЕЛЯ"));
    СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса;
    
    МакетКомпоновки = КомпоновщикМакета.Выполнить(
        СхемаКомпоновкиДанных,
        КомпоновщикНастроек.ПолучитьНастройки(),
        ДанныеРасшифровки
    );

    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(
        МакетКомпоновки,
       , 
        ДанныеРасшифровки
    );

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

    ПроцессорВывода.НачатьВывод();
    ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
    ПроцессорВывода.ЗакончитьВывод();
    
КонецПроцедуры




