// Установить или снять блокировку информационной базы,
// исходя из значений реквизитов обработки.
//
Процедура ВыполнитьУстановку() Экспорт
	
	Блокировка = Новый БлокировкаСеансов;
	Блокировка.Начало           = НачалоДействияБлокировки;
	Блокировка.Конец            = ОкончаниеДействияБлокировки;
	Блокировка.Сообщение        = СоединенияИБ.СформироватьСообщениеБлокировки(Сообщение, КодРазрешения); 
	Блокировка.Установлена      = БлокировкаУстановкиСоединенийВключена;
	Блокировка.КодРазрешения    = КодРазрешения;
	
	УстановитьБлокировкуСеансов(Блокировка);
	
КонецПроцедуры

// Зачитать параметры блокировки информационной базы 
// в реквизиты обработки.
//
Процедура ПолучитьПараметрыБлокировки() Экспорт
	
	ТекущийРежим = ПолучитьБлокировкуСеансов();
	
	БлокировкаУстановкиСоединенийВключена = ТекущийРежим.Установлена;
	Сообщение = СоединенияИБКлиентСервер.ИзвлечьСообщениеБлокировки(ТекущийРежим.Сообщение);
	КодРазрешения = ТекущийРежим.КодРазрешения;
	
	Если БлокировкаУстановкиСоединенийВключена Тогда
		НачалоДействияБлокировки    = ТекущийРежим.Начало;
		ОкончаниеДействияБлокировки = ТекущийРежим.Конец;
	Иначе	
		// Если блокировка не установлена, можно предположить, что
		// пользователь открыл форму для установки блокировки.
		// Поэтому устанавливаем дату блокировки равной текущей дате
		НачалоДействияБлокировки     = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

