
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Структура подчиненности"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Формирует массив реквизитов документа. 
// 
// Параметры: 
// ИмяДокумента - Строка - имя документа.
// 
// Возвращаемое значение: 
// Массив - массив наименований реквизитов документа. 
// 
Функция МассивДополнительныхРеквизитовДокумента(ИмяДокумента) Экспорт
	
	МассивДопРеквизитов = Новый Массив;
	
	
	
	Возврат МассивДопРеквизитов
	
КонецФункции

// Получает предстваление документа для печати
//
// Параметры
//  Выборка  - КоллекцияДанных - структура или выборка из результатов запроса
//                 в которой содержатся дополнительные реквизиты, на основании
//                 которых можно сформировать переопределенное предстваление до-
//                 кумента для вывода в отчет "Структура подчиненности"
//
// Возвращаемое значение:
//   Строка,Неопределено   - переопределенное представление документа, или Нео-
//                пределено, если для данного типа документов такое не задано.
//
Функция ПолучитьПредставлениеДокументаДляПечати(Выборка) Экспорт

	
	
	Возврат Неопределено;

КонецФункции
