&НаКлиенте
Процедура ОткрытьНаборСвойствПроектов(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ТекстВопроса = НСтр("ru = 'Для перехода к набору свойств элемент необходимо записать.'") + Символы.ПС + НСтр("ru = 'Записать?'");
		Результат = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьНаборСвойствПроектовЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
        Возврат;	
		
	КонецЕсли;	
	
	ОткрытьНаборСвойствПроектовФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаборСвойствПроектовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Результат = РезультатВопроса;
	
	Если Результат <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Не Записать() Тогда 
		Возврат;
	КонецЕсли;	
	
	
	ОткрытьНаборСвойствПроектовФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаборСвойствПроектовФрагмент()
	
	ПоказатьЗначение(Неопределено, Объект.НаборСвойствПроектов);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаборСвойствПроектныхЗадач(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ТекстВопроса = НСтр("ru = 'Для перехода к набору свойств элемент необходимо записать.'") + Символы.ПС + НСтр("ru = 'Записать?'");
		Результат = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьНаборСвойствПроектныхЗадачЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
        Возврат;	
		
	КонецЕсли;	
	
	ОткрытьНаборСвойствПроектныхЗадачФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаборСвойствПроектныхЗадачЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Результат = РезультатВопроса;
	
	Если Результат <> КодВозвратаДиалога.Да Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Не Записать() Тогда 
		Возврат;
	КонецЕсли;	
	
	
	ОткрытьНаборСвойствПроектныхЗадачФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаборСвойствПроектныхЗадачФрагмент()
	
	ПоказатьЗначение(Неопределено, Объект.НаборСвойствПроектныхЗадач);

КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ОткрытьФормуРедактированияКомментария(Элемент.ТекстРедактирования, Объект.Комментарий, Модифицированность);
	
КонецПроцедуры
