
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Файл = Параметры.Файл;
	Сообщение = Параметры.Сообщение;
	
	РежимСозданияФайла = 1;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Закрыть(РежимСозданияФайла);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКаталог(Команда)
	
	ФайловыеФункцииСлужебныйКлиент.ОткрытьПроводникСФайлом(Файл);
	
КонецПроцедуры
