////////////////////////////////////////////////////////////////////////////////
// Подсистема "Файловые функции".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// См. эту функцию в модуле ФайловыеФункцииСлужебный.
Функция ПолучитьСписокРасширенийФайловOpenDocument() Экспорт
	
	Возврат ФайловыеФункцииСлужебный.ПолучитьСписокРасширенийФайловOpenDocument();
	
КонецФункции

// См. эту функцию в модуле ФайловыеФункцииСлужебный.
Функция ПолучитьСписокРасширенийТекстовыхФайлов() Экспорт
	
	Возврат ФайловыеФункцииСлужебный.ПолучитьСписокРасширенийТекстовыхФайлов();
	
КонецФункции

// См. эту процедуру в модуле ФайловыеФункцииСлужебный.
Процедура ЗаписатьРезультатИзвлеченияТекста(ФайлИлиВерсияСсылка,
                                            РезультатИзвлечения,
                                            АдресВременногоХранилищаТекста) Экспорт
	
	ФайловыеФункцииСлужебный.ЗаписатьРезультатИзвлеченияТекста(
		ФайлИлиВерсияСсылка,
		РезультатИзвлечения,
		АдресВременногоХранилищаТекста);
	
КонецПроцедуры

// Возвращает флажок наличия хотя бы одного файла в томах.
Функция ЕстьФайлыВТомах() Экспорт
	
	Если ФайловыеФункцииСлужебный.ПолучитьКоличествоФайловВТомах() <> 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
