&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	РазмерВРабочемКаталоге = Параметры.РазмерВРабочемКаталоге;
	РазмерФайлаНаСервере = Параметры.РазмерФайлаНаСервере;
	Файл = Параметры.Файл;
	Сообщение = Параметры.Сообщение;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКаталог(Команда)
	
	ФайловыеФункцииСлужебныйКлиент.ОткрытьПроводникСФайлом(Файл);
	
КонецПроцедуры
