////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с файлами".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подключение управления доступом в подсистеме РаботаСФайламиВызовСервера.

// Можно ли занять данный файл
//
// Параметры:
//  ДанныеФайла - структура с данными файла
//  СтрокаОшибки - строка, содержащая текст ошибки в случае невозможности занять
//
// Возвращаемое значение:
//  Булево.
Функция ВозможноЗанятьФайл(ДанныеФайла, СтрокаОшибки = "") Экспорт 

	Возврат Истина;
	
КонецФункции

// Функция ПометкаУдаленияРазрешена, при использовании ограничения
// пометки удаления проверяет, разрешена ли текущему пользователю
// пометка удаления папки файлов или файла.
// 
// Параметры:
//  Ссылка       - СправочникСсылка.ПапкиФайлов, СправочникСсылка.Файлы,
//                 <ссылка на владельца>.
//
// Возвращаемое значение:
//  Булево.
//
Функция ПометкаУдаленияРазрешена(Ссылка) Экспорт
	
	
	
	Возврат Истина;
	
КонецФункции

