
&НаКлиенте
Процедура Выгрузить(Команда)
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект));	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	Если НЕ Подключено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(ПроектСсылка) Тогда
		Текст = НСтр("ru = 'Поле ""Проект"" не заполнено.'");
		Путь = "ПроектСсылка";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		Текст,
		,
		Путь,
		,
		Отказ);	
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	АдресФайла = ВыгрузитьНаСервере(Отказ,ОписаниеОшибки);
	
	Если Отказ Тогда
		ПоказатьПредупреждение(Неопределено, ОписаниеОшибки);
		Возврат;
	Иначе
		Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
			
			ПолучитьФайл(АдресФайла,"",Истина);
			
		Иначе
			ПоказатьПредупреждение(Неопределено, "Ошибка получения файла с сервера! Адрес файла не существует! "+АдресФайла);
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ВыгрузитьНаСервере(Отказ,ОписаниеОшибки)
	АдресФайла = "";
	Отказ = Ложь;
	мСоответствиеЗадач  = Новый соответствие();  //соответствие, для последующего добавления предшественников, если они будут.
	ПутьКФайлуНаСервере = ПолучитьИмяВременногоФайла();
	
	Попытка
		MSProject = Новый COMОбъект("MSProject.Application");
		MSProject.FileNew();
		MSProject.DisplayAlerts = False;	
		MSProject.ActiveProject.HoursPerDay = 8;
		
		TableTasks = MSProject.ActiveProject.Tasks;
		
		//для добавления колонок на рабочую область, использую метод TableEditEx у Application:		
		ИмяТаблицы = "&Ввод";
		ПозицияКолонки = 2;
		ТипПоля = "Текст1";
		//MSProject.Application.TableEditEx(ИмяТаблицы,True,,,,, ТипПоля ,"Представление колонки",,,,,,,  ПозицияКолонки ,,,,,);
		
		//Фактически в таблице хранится фиксированное количество столбцов и мы лишь можем управлять 
		//видимостью их и изменением свойств. Поэтому мы можем в любой столбец прописать свои значения, 
		//даже если его не видно на листе. Чтобы отобразить данные, нужно добавить колонку с тем типом данных,
		//который мы указали. Второй параметр должен быть True. Список имен таблиц можно увидеть выполнив 
		//макрос с одним единственным словом Tables (может есть и "нормальный" вызов этого списка, но я 
		//этими поисками не занимался). После этого на форме появится список всех доступных таблиц проекта.
		
		
		MSProject.Application.TableApply(ИмяТаблицы);
		
		//Добавим задачу в проект:
		NewTask = TableTasks.Add();
		//мСоответствиеЗадач.Вставить(Задача1С, NewTask);
		
		NewTask.Name = "Название";
		NewTask.Milestone = True;  // Веха
		
		//Если ЗначениеЗаполнено(ДатаНачалаПлан) Тогда
		//NewTask.Start = ДатаНачалаПлан + Hour * 9;
		//КонецЕсли;
		//Если ЗначениеЗаполнено(ДатаОкончанияПлан) Тогда
		//NewTask.Finish = ДатаОкончанияПлан + Hour * 18;
		//КонецЕсли;
		
		//Остальные поля можно редактировать через метод SetField, 
		//который умеет работать через константы имен полей и их ID 
		//(можно посмотреть в справке все ID всех доступных полей). Пример через ID:
		//NewTask.SetField(188743731, КодСДР); // Текст1
		
		//Добавим ресурсы через константу по имени поля. В квадратных скобках указывается Загрузка ресурса:
		//Если ресурсов больше, чем один, то они указываются в одну строку через точку с запятой.
		//FieldRes = Tasks.Application.FieldNameToFieldConstant("Названия ресурсов");
		//NewTask.SetField(FieldRes, Исполнитель.Наименование + "[80%]");		
		
		//Добавим предшественников с помощью метода  LinkPredecessors. Здесь-то нам и понадобится соответствие задач 1С и задач Project'а:
		//LinkTask = мСоответствиеЗадач[ЗадачаПредшественник];
		//Task.LinkPredecessors(LinkTask);
		
		//Можно изменить шрифт:
		//MSProject.Application.SelectSheet();
		//MSProject.Application.Font32Ex("Arial", 8 , True);
		
		//Сохраним и выйдем:
		MSProject.FileSaveAs(ПутьКФайлуНаСервере);
		MSProject.Application.Quit();
		MSProject = Неопределено;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Отказ = Истина;
	КонецПопытки;
	
	//Поместим файл в адресное хранилище
	Если Не Отказ Тогда
		ДанныеФайла = Новый ДвоичныеДанные(ПутьКФайлуНаСервере);
		Возврат ПоместитьВоВременноеХранилище(ДанныеФайла,ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат АдресФайла;
КонецФункции

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроектСсылка = Параметры.Проект;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если вебклиент Тогда
		НачатьУстановкуРасширенияРаботыСФайлами(Неопределено);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Результат = ОткрытьФорму("Справочник.Проекты.ФормаВыбора", , Элемент); 
	
КонецПроцедуры

