
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсточникСписка = Параметры.Источник;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
		"Заявка",
		Параметры.Источник);
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	Форма = ПолучитьФорму("РегистрСведений.ПодписчикиЗаявок.ФормаЗаписи");
	Форма.Запись.Заявка = ИсточникСписка;
	Форма.Открыть();
	Отказ = Истина;
КонецПроцедуры
