//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ, В КОТОРОМ ОПРЕДЕЛЯЮТСЯ НАСТРОЙКИ ПОДСИСТЕМЫ

// Функция должна вернуть список значений с описанием виртуальных подсистем
// Пример кода:
//
//	Функция ОписаниеВиртуальныхПодсистем() Экспорт
//		СписокПодсистем = Новый СписокЗначений;
//		СписокПодсистем.Добавить("Маркетинг\АнализКлиентов", "Работа с клиентами")
//		Возврат СписокПодсистем;
//	КонецФункции
//
Функция ОписаниеВиртуальныхПодсистем() Экспорт
	
	СписокПодсистем = Новый СписокЗначений;
	
	Возврат СписокПодсистем;
	
КонецФункции

// Функция должна вернуть соответсвие с кодом сортировки для каждого варианта отчета
// Пример кода:
//
//	Функция СортировкаПредопределенныхВариантов() Экспорт
//		СоответствиеСортировкиИВариантов = Новый Соответствие;
//		СоответствиеСортировкиИВариантов.Вставить("Отчет.БизнесПроцессыИЗадачи\Основной", "АА00001");
//		Возврат СоответствиеСортировкиИВариантов;
//	КонецФункции
//
Функция СортировкаПредопределенныхВариантов() Экспорт
	СоответствиеСортировкиИВариантов = Новый Соответствие;
	Возврат СоответствиеСортировкиИВариантов;
КонецФункции


// Функция должна вернуть список значений с ключами отчета, которые поддерживаются подсистемой
//
Функция СписокОтчетовПоддерживаемыхПодсистемой() Экспорт

	СписокОтчетов = Новый СписокЗначений;
	
	Для Каждого ОтчетМД Из Метаданные.Отчеты Цикл
		СписокОтчетов.Добавить("Отчет."+ ОтчетМД.Имя);
	КонецЦикла; 
	
	Возврат СписокОтчетов;

КонецФункции

// Функция возвращает структуру данных для переопределения командного интерфейса
// Пример кода:
//
//	Функция КомандныйИнтерфейс() Экспорт
//		ДанныеОПодсистемахВариантов = ВариантыОтчетов.НоваяСтруктураКомандногоИнтерфейса();
//		ВариантыОтчетов.ДобавитьПодсистемуВариантаВДопНастройках(ДанныеОПодсистемахВариантов, "Отчет.ДинамикаИзмененийФайлов\СводнаяДиаграммаИзменения", "Администрирование");
//		Возврат ДанныеОПодсистемахВариантов;
//	КонецФункции
//
Функция КомандныйИнтерфейс() Экспорт
	
	ДанныеОПодсистемахВариантов = ВариантыОтчетов.НоваяСтруктураКомандногоИнтерфейса();
	
	Возврат ДанныеОПодсистемахВариантов;
	
КонецФункции	

// Процедура вызывается для стыковки с другими подсистемами
// Заполняет список дополнительных команд, которые должны располагаться на панели
//
Процедура СписокДополнительныхКоманд(ТаблицаДополнительныхКоманд, ПутиПодсистемы) Экспорт
	
КонецПроцедуры

// Процедура вызывается для стыковки с другими подсистемами.
// Стыкуемая подсистема должна хранить признак быстрого доступа. Эта процедура вызывается когда требуется запомнить 
// состояние быстрого команды подсистемы.
//
// Параметры:
//		МассивИдентификаторов   - массив - элемент массива - структуру со свойствами:
//		УникальныйИдентификатор - уникальный идентификатор команды
//		БыстрыйДоступ           - признак видимости команды на панели для всех пользователей
//		ПараметрКоманды         - параметр команды
//
Процедура УстановитьБыстрыйДоступВнешнихКоманд(МассивИдентификаторов) Экспорт
	
КонецПроцедуры
