////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с почтовыми сообщениями".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Открывает форму редактирования нового письма.
// Параметры
// СтандартнаяОбработка - Булево - Должен быть установлен в Ложь в данной процедуре, если 
//                        открывается отличная от простой формы отправки, форма почтового сообщения
// Отправитель*         - СписокЗначений, СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - 
//                        учетная запись (список) с которой(которых) может быть отправлено
//                        почтовое сообщение. Если тип список значений, тогда
//                        представление - наименование учетной записи,
//                        значение - ссылка на учетную запись
//
// Получатель      - СписокЗначений, Строка:
//                   если список значений, то представление - имя получателя
//                                            значение      - почтовый адрес
//                   если строка то список почтовых адресов,
//                   в формате правильного e-mail адреса*
//
// Тема            - Строка - тема письма
// Текст           - Строка - тело письма
//
// СписокФайлов    - СписокЗначений, где
//                   представление - строка - наименование вложения
//                   значение      - ДвоичныеДанные - двоичные данные вложения
//                                 - Строка - адрес файла во временном хранилище
//                                 - Строка - путь к файлу на клиенте
//
// УдалятьФайлыПослеОтправки - булево - удалять временные файлы после отправки сообщения
//
Процедура ОткрытьФормуОтправкиПочтовогоСообщения(СтандартнаяОбработка,
												Отправитель,
												Получатель,
												Тема ,
												Текст = "",
												СписокФайлов = Неопределено,
												УдалятьФайлыПослеОтправки = Ложь) Экспорт
	
	
	
КонецПроцедуры
