////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контроль динамического обновления конфигурации"
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Обработчик ожидания проверяет, что информационная база была обновлена динамически, и 
// сообщает об этом пользователю.
//
Процедура ОбработчикОжиданияПроверкиДинамическогоИзмененияИБ() Экспорт
	
	Если КонтрольДинамическогоОбновленияКонфигурацииВызовСервера.КонфигурацияБДБылаИзмененаДинамически() Тогда
		
		ОтключитьОбработчикОжидания("ОбработчикОжиданияПроверкиДинамическогоИзмененияИБ");
		
		ТекстСообщения = НСтр("ru = 'В конфигурацию информационной базы внесены изменения.
									|Для дальнейшей работы рекомендуется перезапустить программу.
									|Перезапустить?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработчикОжиданияПроверкиДинамическогоИзмененияИБЗавершение", Оповещения), ТекстСообщения, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры


