
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТипЗначения = ПараметрыВыполненияКоманды.Источник.Объект.ТипЗначения;
	
	Если ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектовИерархия")) Тогда
		ИмяФормы = "Справочник.ЗначенияСвойствОбъектовИерархия.ФормаСписка";
	Иначе
		ИмяФормы = "Справочник.ЗначенияСвойствОбъектов.ФормаСписка";
	КонецЕсли;
	
	ОткрытьФорму(
		ИмяФормы,
		Новый Структура("Отбор", Новый Структура("Владелец", ПараметрКоманды)),
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
