////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Исполнители.Отбор, 
		"РольИсполнителя", Параметры.РольИсполнителя, ВидСравненияКомпоновкиДанных.Равно);
	СвойстваРоли = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Параметры.РольИсполнителя, "ИспользуетсяСОбъектамиАдресации,ТипыДополнительногоОбъектаАдресации,ТипыОсновногоОбъектаАдресации");
	Если Не СвойстваРоли.ИспользуетсяСОбъектамиАдресации Тогда
		Исполнители.Группировка.Элементы[0].Использование = Ложь; // ОсновнойОбъектАдресации
		Исполнители.Группировка.Элементы[1].Использование = Ложь; // ДополнительныйОбъектАдресации
	ИначеЕсли СвойстваРоли.ТипыДополнительногоОбъектаАдресации.Пустая() Тогда
		Исполнители.Группировка.Элементы[1].Использование = Ложь; // ДополнительныйОбъектАдресации
	КонецЕсли;
	
	
КонецПроцедуры

