// Открывает форму выбора пользователя.
Процедура ВыбратьПользователя(ЭлементПользователь, РеквизитПользователь) Экспорт
	
	ПараметрыФормы = Новый Структура("Пользователь", РеквизитПользователь);
	ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбораСПодразделениями", ПараметрыФормы, ЭлементПользователь);
	
КонецПроцедуры

// Открывает форму выбора исполнителя.
Процедура ВыбратьИсполнителя(
	ЭлементИсполнитель,
	РеквизитИсполнитель,
	ТолькоПростыеРоли = Истина,
	БезВнешнихРолей = Истина,
	ПоказыватьФункции = Ложь,
	ОсновнойОбъектАдресации = Неопределено,
	ДополнительныйОбъектАдресации = Неопределено,
	ВыбиратьГруппуПользователей = Ложь,
	ПоказыватьКорреспондентов = Ложь,
	//ПоказыватьМоиКонтакты = Ложь) Экспорт
	//АбисСофт-Кострицын Олег-Старт  17 января 2014 г.
	ПоказыватьМоиКонтакты = Ложь,
	ПоказыватьРоли = Ложь,
	ПоказыватьПользователей = Истина) Экспорт
	//АбисСофт-Кострицын Олег-финиш  17 января 2014 г.
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Исполнитель", РеквизитИсполнитель);
	ПараметрыФормы.Вставить("ТолькоПростыеРоли", ТолькоПростыеРоли);
	ПараметрыФормы.Вставить("БезВнешнихРолей", БезВнешнихРолей);
	ПараметрыФормы.Вставить("ПоказыватьФункции", ПоказыватьФункции);
	ПараметрыФормы.Вставить("ОсновнойОбъектАдресации", ОсновнойОбъектАдресации);
	ПараметрыФормы.Вставить("ДополнительныйОбъектАдресации", ДополнительныйОбъектАдресации);
	ПараметрыФормы.Вставить("ВыбиратьГруппуПользователей", ВыбиратьГруппуПользователей);
	ПараметрыФормы.Вставить("ПоказыватьКорреспондентов", ПоказыватьКорреспондентов);
	ПараметрыФормы.Вставить("ПоказыватьМоиКонтакты", ПоказыватьМоиКонтакты);
	
	//АбисСофт-Кострицын Олег-Старт 25 марта 2013 г.
	ПараметрыФормы.Вставить("ПоказыватьРоли", ПоказыватьРоли);
	ПараметрыФормы.Вставить("ПоказыватьКорреспондентов", ПоказыватьКорреспондентов);
	ПараметрыФормы.Вставить("ПоказыватьПользователей", ПоказыватьПользователей);
	//АбисСофт-Кострицын Олег-Финиш 25 марта 2013 г.

	ОткрытьФорму("ОбщаяФорма.ВыборИсполнителя", ПараметрыФормы, ЭлементИсполнитель);
	
КонецПроцедуры

// Открывает форму подбора исполнителей.
Процедура ПодборИсполнителей(
	АдресВременногоХранилища,
	ФормаВладелец,
	ТолькоПростыеРоли = Истина,
	БезВнешнихРолей = Истина,
	ПоказыватьФункции = Ложь,
	ПодбиратьГруппыПользователей = Ложь,
	ПоказыватьКорреспондентов = Ложь,
	ПоказыватьМоиКонтакты = Ложь) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВременногоХранилища", АдресВременногоХранилища);
	ПараметрыФормы.Вставить("ТолькоПростыеРоли", ТолькоПростыеРоли);
	ПараметрыФормы.Вставить("БезВнешнихРолей", БезВнешнихРолей);
	ПараметрыФормы.Вставить("ПоказыватьФункции", ПоказыватьФункции);
	ПараметрыФормы.Вставить("ПодбиратьГруппыПользователей", ПодбиратьГруппыПользователей);
	ПараметрыФормы.Вставить("ПоказыватьКорреспондентов", ПоказыватьКорреспондентов);
	ПараметрыФормы.Вставить("ПоказыватьМоиКонтакты", ПоказыватьМоиКонтакты);
	
	//АбисСофт-Кострицын Олег-Старт 25 марта 2013 г.
	ПараметрыФормы.Вставить("ПоказыватьРоли", Ложь);
	ПараметрыФормы.Вставить("ПоказыватьКорреспондентов", Ложь);	
	//АбисСофт-Кострицын Олег-Финиш 25 марта 2013 г.

	ОткрытьФорму("ОбщаяФорма.ПодборИсполнителей", ПараметрыФормы, ФормаВладелец);
	
КонецПроцедуры
