&НаКлиенте
Процедура Обновить(Команда)
	ПостроитьТаблицуСтатейСервер();
КонецПроцедуры

&НаКлиенте
Процедура СписокСтатейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные<>неопределено Тогда
		ФормаБазыЗнаний = ПолучитьФорму("Обработка.БазаЗнаний.Форма");
		ФормаБазыЗнаний.НачальнаяСтатья = Элемент.ТекущиеДанные.Статья;
		ФормаБазыЗнаний.Открыть();
	КонецЕслИ;	
КонецПроцедуры

&НаСервере
Процедура ПостроитьТаблицуСтатейСервер()
	Порция = РазмерПорции;
	ТаблСтатей = Новый ТаблицаЗначений();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	Статистика.СтатьяБазыЗнаний КАК Статья,
		|	Статистика.СредняяОценка КАК Рейтинг,
		|	Статистика.СтатьяБазыЗнаний.Ответственный КАК Ответственный,
		|	Статистика.Создана КАК ДатаСоздания
		|ИЗ
		|	РегистрСведений.СтатистикаСтатейБазыЗнаний КАК Статистика";
	ТекстУпорядочивания = "";
	Если ТипСтатей = "Рекомендуемые" Тогда
		ТекстУпорядочивания =" 
		|УПОРЯДОЧИТЬ ПО
		|	Статистика.СредняяОценка УБЫВ,
		|	Статистика.Просмотры УБЫВ";
	ИначеЕсли ТипСтатей = "Новые" Тогда
		ТекстУпорядочивания ="
		|УПОРЯДОЧИТЬ ПО
		|	Статистика.Создана УБЫВ";
	ИначеЕсли ТипСтатей = "Популярные" Тогда
		ТекстУпорядочивания ="
		|УПОРЯДОЧИТЬ ПО
		|	Статистика.Просмотры УБЫВ";
	ИначеЕсли ТипСтатей = "Рейтинговые" Тогда
		ТекстУпорядочивания ="
		|УПОРЯДОЧИТЬ ПО
		|	Статистика.СредняяОценка УБЫВ";
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса+ТекстУпорядочивания;
	ТаблСтатей = Запрос.Выполнить().Выгрузить();
	
	ТаблицаСтатей.Очистить();
	Для Каждого Стр Из ТаблСтатей Цикл
		НоваяСтрока = ТаблицаСтатей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СписокТиповСтатейПриИзменении(Элемент)
	ПостроитьТаблицуСтатейСервер();
КонецПроцедуры

&НаКлиенте
Процедура РазмерПорцииПриИзменении(Элемент)
	ПостроитьТаблицуСтатейСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Список = Элементы.СписокТиповСтатей.СписокВыбора;
	Список.Добавить("Новые", "Новые");
	Список.Добавить("Рекомендуемые", "Рекомендуемые");
	Список.Добавить("Рейтинговые", "Рейтинговые");
	Список.Добавить("Популярные", "Популярные");
	
	ТекЭлемент = Список.Получить(0);
	ТипСтатей = ТекЭлемент.Значение;
	РазмерПорции = 10;
	
	ПостроитьТаблицуСтатейСервер();
КонецПроцедуры
