Процедура ФормаУстановитьТипПредмета(Форма) Экспорт
	ИмяТипаПредмета = "";
	Если ЗначениеЗаполнено(Форма.Объект.Предмет) Тогда
		ИмяТипаПредмета = Строка(ТипЗнч(Форма.Объект.Предмет));
	КонецЕсли;
	СписокТипов = РаботаСФайламиВызовСервера.ПолучитьПредставленияТипов(Форма.Объект.Ссылка.Метаданные().Реквизиты.Предмет.Тип.Типы());
	Форма.ТипПредмета = "";
	Форма.Элементы.ТипПредмета.СписокВыбора.Очистить();
	Для Каждого Запись Из СписокТипов Цикл
		Форма.Элементы.ТипПредмета.СписокВыбора.Добавить(Запись.Значение, Запись.Представление);
		Если ИмяТипаПредмета = Запись.Представление Тогда
			Форма.ТипПредмета = Запись.Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

//Получает значение функциональной опции ИспользоватьДатуИВремяВСрокахЗадач
Функция ПолучитьИспользованиеДатыИВремениВСрокахЗадач() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
КонецФункции

