
////////////////////////////////////////////////////////////////////////////////
// Блок сервисных функций
//

// Заполняет отчет
//
&НаСервере
Функция ВывестиОтчет()
	
	РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ТаблицаОтчета, СписокВерсий);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Блок обработчиков событий
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Ссылка) 
	   И Параметры.Свойство("СписокВерсий") Тогда
		Отчет.СсылкаНаОбъект = Параметры.Ссылка;
		
		СписокВерсий = Параметры.СписокВерсий;
		
		Если СписокВерсий.Количество() > 1 Тогда
			СтрокаНомераВерсий = "";
			
			СписокВерсий.СортироватьПоЗначению();
			
			Для Каждого ЭлементСпискаВерсий Из СписокВерсий Цикл
				СтрокаНомераВерсий = СтрокаНомераВерсий + Строка(ЭлементСпискаВерсий) + ", ";
			КонецЦикла;
			
			СтрокаНомераВерсий = Лев(СтрокаНомераВерсий, СтрДлина(СтрокаНомераВерсий) - 2);
			
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			                 НСтр("ru = 'Отчет по изменениям версий объекта %1 №№ %2'"),
			                 Параметры.Ссылка,
			                 СтрокаНомераВерсий);
		Иначе
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			                 НСтр("ru = 'Версия объекта %1 № %2'"),
			                 Параметры.Ссылка,
			                 Строка(СписокВерсий[0]));
		КонецЕсли;
		
		ВывестиОтчет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Отчет.СсылкаНаОбъект)
	   И СписокВерсий.Количество() = 0 Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Интерактивное использование запрещено'"));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
