////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗависимостиПравДоступа.ПодчиненнаяТаблица,
	|	ЗависимостиПравДоступа.ТипВедущейТаблицы,
	|	ЗависимостиПравДоступа.ОтключитьПроверкуПравВедущейТаблицы,
	|	ЗависимостиПравДоступа.ПриПроверкеПраваЧтение,
	|	ЗависимостиПравДоступа.ПриПроверкеПраваДобавление,
	|	ЗависимостиПравДоступа.ПриПроверкеПраваИзменение,
	|	ЗависимостиПравДоступа.ПриПроверкеПраваУдаление
	|ПОМЕСТИТЬ ЗависимостиПравДоступа
	|ИЗ
	|	&ЗависимостиПравДоступа КАК ЗависимостиПравДоступа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗависимостиПравДоступа.ПодчиненнаяТаблица,
	|	ЗависимостиПравДоступа.ТипВедущейТаблицы,
	|	ЗависимостиПравДоступа.ОтключитьПроверкуПравВедущейТаблицы,
	|	ВЫБОР
	|		КОГДА ЗависимостиПравДоступа.ПриПроверкеПраваЧтение В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоЧтения), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоДобавления), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоИзменения))
	|			ТОГДА ЗависимостиПравДоступа.ПриПроверкеПраваЧтение
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоЧтения)
	|	КОНЕЦ КАК ПриПроверкеПраваЧтение,
	|	ВЫБОР
	|		КОГДА ЗависимостиПравДоступа.ПриПроверкеПраваДобавление В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоЧтения), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоДобавления), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоИзменения))
	|			ТОГДА ЗависимостиПравДоступа.ПриПроверкеПраваДобавление
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоИзменения)
	|	КОНЕЦ КАК ПриПроверкеПраваДобавление,
	|	ВЫБОР
	|		КОГДА ЗависимостиПравДоступа.ПриПроверкеПраваИзменение В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоЧтения), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоДобавления), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоИзменения))
	|			ТОГДА ЗависимостиПравДоступа.ПриПроверкеПраваИзменение
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоИзменения)
	|	КОНЕЦ КАК ПриПроверкеПраваИзменение,
	|	ВЫБОР
	|		КОГДА ЗависимостиПравДоступа.ПриПроверкеПраваУдаление В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоЧтения), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоДобавления), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоИзменения))
	|			ТОГДА ЗависимостиПравДоступа.ПриПроверкеПраваУдаление
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыДоступа.ПравоИзменения)
	|	КОНЕЦ КАК ПриПроверкеПраваУдаление
	|ИЗ
	|	ЗависимостиПравДоступа КАК ЗависимостиПравДоступа");
	Запрос.УстановитьПараметр("ЗависимостиПравДоступа", Выгрузить());
	
	Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Проверка ОбменДанными.Загрузка должна выполняться после кода выше.
	
КонецПроцедуры
