Процедура ПроверитьЗаполнениеРеквизитов(ТекущийОбъект,Отказ);
	
КонецПроцедуры

Процедура ЗаписатьТекстСтатьи(ЭтотОбъект,ТекущийОбъект,Отказ);
	Если Не Отказ Тогда
		ТекстHTML = ТекущийОбъект.ТекстСтатьиHTML;
		
		Для Каждого Стр Из ЭтотОбъект.ТаблицаВложений Цикл
			ТекстHTML = СтрЗаменить(ТекстHTML,?(ЗначениеЗаполнено(Стр.ИмяЛокальногоФайла),Стр.ИмяЛокальногоФайла,Стр.Адрес),Стр.Ключ);
		КонецЦикла;
		
		ФД_ОписаниеЗаявки = Новый ФорматированныйДокумент;
		ФД_ОписаниеЗаявки.УстановитьHTML(ТекстHTML,Новый Структура());
		ТекущийОбъект.ТекстСтатьи = ФД_ОписаниеЗаявки.ПолучитьТекст();
		
		ТекущийОбъект.ТекстСтатьиHTML = ТекстHTML;
	КонецЕслИ;	
КонецПроцедуры

Процедура СохранитьОбъектыHTML(ТекстHTML,ТаблВложений,Ссылка) Экспорт
	НаборЗаписей = РегистрыСведений.ОбъектыHTMLСтраниц.СоздатьНаборЗаписей();
	ТекОтбор = НаборЗаписей.Отбор.Владелец;
	ТекОтбор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	ТаблЗаписей = НаборЗаписей.Выгрузить();
	ТаблЗаписей.Очистить();
	Для Каждого Стр Из ТаблВложений Цикл
		Если Найти(ТекстHTML,Стр.Ключ) > 0 Тогда
			НоваяСтрока = ТаблЗаписей.Добавить();
			НоваяСтрока.Идентификатор = Стр.Ключ;
			НоваяСтрока.Владелец = Ссылка;
			НоваяСтрока.Вложение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Стр.Адрес));
		КонецЕсли;
	КонецЦикла;
	Наборзаписей.Загрузить(ТаблЗаписей);
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура МодульОбъектаПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	ПроверитьЗаполнениеРеквизитов(ТекущийОбъект,Отказ);
	
	ЗаписатьТекстСтатьи(ЭтотОбъект,ТекущийОбъект,Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый"		, ЭтотОбъект.ЭтоНовый());	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	БазаЗнанийСервер.ЗарегистрироватьИзменениеСтатьи(ЭтотОбъект.Ссылка);
	
КонецПроцедуры
