////////////////////////////////////////////////////////////////////////////////
// Подсистема "Завершение работы пользователей"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Обработчик открытия формы активных пользователей для последующей установки блокировки на работу пользователей с ИБ.
//
//  Параметры:
// СтандартнаяОбработка – Булево. Флаг стандартной обработки. Стандартная обработка не подразумевает никаких действий.
// Владелец – Форма. Форма, которая является владельцем по отношению к открываемой форме монитора активных пользователей.
//
Процедура ПриОткрытииФормыАктивныхПользователей(СтандартнаяОбработка, Владелец) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.БлокировкаРаботыПользователей.Форма",, Владелец);
	
КонецПроцедуры

