// Обрабатывает просмотр элемента в форме 
// Возвращает Истина, если сообщение не было просмотрено ранее
// Необходимо наличие в форме реквизитов:
// 	УстановленПросмотр - Булево - флаг просмотра нового сообщения за время работы формы
//  ТаблицаПросмотров - ТаблицаЗначений - просмотр сообщений во время работы с формой
//	
//  Колонки ТаблицаПросмотров:
//   Ссылка - СправочникСсылка.СообщенияОбсуждений - просмотренный элемент 
//   ДатаПоследнегоПросмотра - Дата - дата просмотра
// 
// Необходимо наличие у элемента свойств:
// 	СообщениеНеПросмотрено - Булево - флаг просмотра элемента
//  Ссылка - СправочникСсылка.СообщенияОбсуждений - ссылка на элемент
Функция ОбработатьПросмотрВСписке(Форма, Элемент) Экспорт
	
	ПросмотрНовогоСообщения = Ложь;
	Форма.УстановленПросмотр = Истина;
	ТекущаяДата = ТекущаяДата();
	
	Если Элемент.ТекущиеДанные.СообщениеНеПросмотрено Тогда
		ПросмотрНовогоСообщения = Истина;
	КонецЕсли;
	Элемент.ТекущиеДанные.СообщениеНеПросмотрено = Ложь;
	
	ПараметрыОтбора = Новый Структура("Ссылка", Элемент.ТекущиеДанные.Ссылка);
	НайденныйМассив = Форма.ТаблицаПросмотров.НайтиСтроки(ПараметрыОтбора);
	Если НайденныйМассив.Количество() = 0 Тогда
		СтрокаПросмотра = Форма.ТаблицаПросмотров.Добавить();
		СтрокаПросмотра.ДатаПоследнегоПросмотра = ТекущаяДата;
		СтрокаПросмотра.Ссылка = Элемент.ТекущиеДанные.Ссылка;
	Иначе
		НайденныйМассив.Получить(0).ДатаПоследнегоПросмотра = ТекущаяДата();
	КонецЕсли;
	Возврат ПросмотрНовогоСообщения;
	
КонецФункции
