////////////////////////////////////////////////Клиентские Обработчики формы///////////////////////////////////////////////
&НаКлиенте
Процедура ЗаполнитьНачисления(Команда)
	//Проверим заполненность реквизитов
	Если не ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ПоказатьПредупреждение(Неопределено, "Не указан сотрудник для начисления!");
		Возврат;
	КонецЕсли;	
	
	Если не ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		ПоказатьПредупреждение(Неопределено, "Не указан месяц начисления!");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Перезаполнить начисления по сотруднику?";
	
	Если Объект.Начисления.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНачисленияЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
        Возврат;	
	Иначе
		ЗаполнитьТаблицуНачислений();
	КонецЕсли;
	ЗаполнитьНачисленияФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачисленияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуНачислений();
	КонецЕсли;	
	
	ЗаполнитьНачисленияФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачисленияФрагмент()
	
	ЭтотОбъект.Модифицированность = истина;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьНачисления(Команда)
	РассчитатьНачисленияСервер();
	ЭтотОбъект.Модифицированность = истина;
КонецПроцедуры

&НаКлиенте
Процедура ДатаРегистрацииПриИзменении(Элемент)
	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//РаботаСПользователямиКлиент.ВыбратьИсполнителя(Элемент, Объект.Ответственный,,,,
	//		Неопределено, 
	//		Неопределено,Ложь,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//РаботаСПользователямиКлиент.ВыбратьИсполнителя(Элемент, Объект.Сотрудник,,,,
	//		Неопределено, 
	//		Неопределено,Ложь,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИсточникОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ИсточникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументИсточника(Команда)
	ТекСтрока = Элементы.Начисления.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда 
		Источник = ТекСтрока.Источник;
		ПоказатьЗначение(Неопределено, Источник); 
	КонецЕсли;	
КонецПроцедуры

////////////////////////////////////////////////Серверные Обработчики формы///////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
		Объект.ПериодРегистрации = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////Клиентские служебные процедуры///////////////////////////////////////////////

&НаКлиенте
Процедура УстановитьВидимость()
	ТолькоПросмотр = ЭтотОбъект.ТолькоПросмотр;
	Элементы.ГруппаНачЗаполнения.Видимость = Не ТолькоПросмотр;
	Элементы.ГруппаНачПросмотра.Видимость = ТолькоПросмотр;
	
	Элементы.ГруппаНачЗакрЗаполнения.Видимость = Не ТолькоПросмотр;
	Элементы.ГруппаНачЗакрПросмотра.Видимость = ТолькоПросмотр;

КонецПроцедуры

////////////////////////////////////////////////Серверные служебные процедуры///////////////////////////////////////////////

&НаСервере
Функция ЭтоНовыйДокумент()
	Возврат Объект.Ссылка.Пустая();
КонецФункции	

&НаСервере
Процедура ЗаполнитьТаблицуНачислений()
	Объект.Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.ВидРабот,
	|	ФактическиеТрудозатраты.Источник,
	|	ВЫБОР
	|		КОГДА ФактическиеТрудозатраты.Источник ССЫЛКА Документ.Заявка
	|			ТОГДА """"
	|		ИНАЧЕ ФактическиеТрудозатраты.ОписаниеРаботы
	|	КОНЕЦ КАК ОписаниеРаботы,
	|	ФактическиеТрудозатраты.Пользователь,
	|	СУММА(ВЫРАЗИТЬ(ФактическиеТрудозатраты.Длительность / 3600 КАК ЧИСЛО(15, 2))) КАК Трудозатраты,
	|	ТарифыПоВидамРаботСрезПоследних.Тариф КАК Тариф,
	|	ФактическиеТрудозатраты.РольПользователя КАК Роль,
	|	СУММА(ВЫРАЗИТЬ(ФактическиеТрудозатраты.Длительность / 3600 КАК ЧИСЛО(15, 2))) КАК НачисленоЧасов
	|ПОМЕСТИТЬ ВыборкаДанных
	|ИЗ
	|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПоВидамРабот.СрезПоследних(&ДатаКон, Сотрудник = &Сотрудник) КАК ТарифыПоВидамРаботСрезПоследних
	|		ПО ФактическиеТрудозатраты.ВидРабот = ТарифыПоВидамРаботСрезПоследних.ВидРабот
	|			И ФактическиеТрудозатраты.Пользователь = ТарифыПоВидамРаботСрезПоследних.Сотрудник
	|			И ФактическиеТрудозатраты.РольПользователя = ТарифыПоВидамРаботСрезПоследних.РольНаПроекте
	|			И ФактическиеТрудозатраты.Проект = ТарифыПоВидамРаботСрезПоследних.Проект
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ФактическиеТрудозатраты.МесяцНачисления, МЕСЯЦ) = &ДатаМесяца
	|	И ФактическиеТрудозатраты.Пользователь = &Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.ВидРабот,
	|	ФактическиеТрудозатраты.РольПользователя,
	|	ФактическиеТрудозатраты.Пользователь,
	|	ФактическиеТрудозатраты.Источник,
	|	ВЫБОР
	|		КОГДА ФактическиеТрудозатраты.Источник ССЫЛКА Документ.Заявка
	|			ТОГДА """"
	|		ИНАЧЕ ФактическиеТрудозатраты.ОписаниеРаботы
	|	КОНЕЦ,
	|	ТарифыПоВидамРаботСрезПоследних.Тариф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыборкаДанных.Проект,
	|	ВыборкаДанных.ПроектнаяЗадача,
	|	ВыборкаДанных.ВидРабот,
	|	ВыборкаДанных.Источник,
	|	ВыборкаДанных.ОписаниеРаботы,
	|	ВыборкаДанных.Пользователь,
	|	ВыборкаДанных.Трудозатраты,
	|	ЕСТЬNULL(ВыборкаДанных.Тариф, ВложенныйЗапрос.Тариф) КАК Тариф,
	|	ВыборкаДанных.Роль,
	|	ВыборкаДанных.НачисленоЧасов
	|ИЗ
	|	ВыборкаДанных КАК ВыборкаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТарифыПоВидамРаботСрезПоследних.Сотрудник КАК Сотрудник,
	|			ТарифыПоВидамРаботСрезПоследних.ВидРабот КАК ВидРабот,
	|			ТарифыПоВидамРаботСрезПоследних.РольНаПроекте КАК РольНаПроекте,
	|			МАКСИМУМ(ТарифыПоВидамРаботСрезПоследних.Тариф) КАК Тариф
	|		ИЗ
	|			РегистрСведений.ТарифыПоВидамРабот.СрезПоследних(&ДатаКон, Сотрудник = &Сотрудник) КАК ТарифыПоВидамРаботСрезПоследних
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТарифыПоВидамРаботСрезПоследних.Сотрудник,
	|			ТарифыПоВидамРаботСрезПоследних.ВидРабот,
	|			ТарифыПоВидамРаботСрезПоследних.РольНаПроекте) КАК ВложенныйЗапрос
	|		ПО ВыборкаДанных.Пользователь = ВложенныйЗапрос.Сотрудник
	|			И ВыборкаДанных.ВидРабот = ВложенныйЗапрос.ВидРабот
	|			И ВыборкаДанных.Роль = ВложенныйЗапрос.РольНаПроекте";

	Запрос.УстановитьПараметр("ДатаМесяца", НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Сотрудник",Объект.Сотрудник);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияПоПроектамОбороты.Источник
		|ИЗ
		|	РегистрНакопления.НачисленияПоПроектам.Обороты(&ДатаС, &ДатаПо,, Пользователь = &Пользователь) КАК НачисленияПоПроектамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияПоПроектамОбороты.Источник";

	Запрос.УстановитьПараметр("ДатаПо", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаС", НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Пользователь", Объект.Сотрудник);
	
	ТаблицаПроизведенныхНачислений = Запрос.Выполнить().Выгрузить();
	СтруктураПоиска = Новый Структура();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПоиска.Очистить();
		СтруктураПоиска.Вставить("Источник",ВыборкаДетальныеЗаписи.Источник);
		МассивСтрок = ТаблицаПроизведенныхНачислений.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() <> 0 Тогда
			Сообщить("Для "+ВыборкаДетальныеЗаписи.Источник+" уже было начисление в этом месяце",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = Объект.Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	ДополнитьТаблицуНачисленийСервер(Истина);

КонецПроцедуры

&НаСервере
Функция ПолучитьДополнительныеДанныеНачисления()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеТрудозатратыПоЗаявкам.Источник КАК Заявка,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель КАК Роль,
	|	МАКСИМУМ(ПлановыеТрудозатратыПоЗаявкам.Длительность) КАК Оценка
	|ПОМЕСТИТЬ ОценкаПолная
	|ИЗ
	|	РегистрСведений.ПлановыеТрудозатратыПоЗаявкам.СрезПоследних(, ) КАК ПлановыеТрудозатратыПоЗаявкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатратыПоЗаявкам.Источник,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеТрудозатратыПоЗаявкам.Источник КАК Заявка,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель КАК Роль,
	|	МАКСИМУМ(ПлановыеТрудозатратыПоЗаявкам.Длительность) КАК Оценка
	|ПОМЕСТИТЬ ОценкаТекПериод
	|ИЗ
	|	РегистрСведений.ПлановыеТрудозатратыПоЗаявкам.СрезПоследних(&ДатаКон, ) КАК ПлановыеТрудозатратыПоЗаявкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатратыПоЗаявкам.Источник,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеТрудозатратыПоЗаявкам.Источник КАК Заявка,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель КАК Роль,
	|	МАКСИМУМ(ПлановыеТрудозатратыПоЗаявкам.Длительность) КАК Оценка
	|ПОМЕСТИТЬ ОценкаПрошлыйПериод
	|ИЗ
	|	РегистрСведений.ПлановыеТрудозатратыПоЗаявкам.СрезПоследних(ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1), ) КАК ПлановыеТрудозатратыПоЗаявкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатратыПоЗаявкам.Источник,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОценкаПрошлыйПериод.Оценка, 0) КАК ОценкаПрошлыйПериод,
	|	ЕСТЬNULL(ОценкаТекПериод.Оценка, 0) КАК ОценкаТекПериод,
	|	ЕСТЬNULL(ОценкаПрошлыйПериод.Заявка, ОценкаТекПериод.Заявка) КАК Заявка,
	|	ЕСТЬNULL(ОценкаПрошлыйПериод.Роль, ОценкаТекПериод.Роль) КАК Роль,
	|	ОценкаПолная.Оценка КАК ОценкаПолная
	|ПОМЕСТИТЬ СвязьОценок
	|ИЗ
	|	ОценкаПолная КАК ОценкаПолная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОценкаПрошлыйПериод КАК ОценкаПрошлыйПериод
	|		ПО ОценкаПолная.Роль = ОценкаПрошлыйПериод.Роль
	|			И ОценкаПолная.Заявка = ОценкаПрошлыйПериод.Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОценкаПолная КАК ОценкаТекПериод
	|		ПО ОценкаПолная.Заявка = ОценкаТекПериод.Заявка
	|			И ОценкаПолная.Роль = ОценкаТекПериод.Роль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.ВидРабот,
	|	ФактическиеТрудозатраты.РольПользователя,
	|	СУММА(ФактическиеТрудозатраты.Длительность) КАК Трудозатраты
	|ПОМЕСТИТЬ ТрудоЗатратыПрошлыйПериод
	|ИЗ
	|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ФактическиеТрудозатраты.МесяцНачисления, МЕСЯЦ) < &ДатаНач
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.ВидРабот,
	|	ФактическиеТрудозатраты.РольПользователя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.ВидРабот,
	|	ФактическиеТрудозатраты.РольПользователя,
	|	СУММА(ФактическиеТрудозатраты.Длительность) КАК Трудозатраты
	|ПОМЕСТИТЬ ТрудоЗатратыТекПериод
	|ИЗ
	|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
	|ГДЕ
	|	ФактическиеТрудозатраты.Пользователь = &Сотрудник
	|	И НАЧАЛОПЕРИОДА(ФактическиеТрудозатраты.МесяцНачисления, МЕСЯЦ) = &ДатаНач
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.ВидРабот,
	|	ФактическиеТрудозатраты.РольПользователя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияПоПроектамОбороты.Проект,
	|	НачисленияПоПроектамОбороты.ПроектнаяЗадача,
	|	НачисленияПоПроектамОбороты.Источник,
	|	НачисленияПоПроектамОбороты.ВидРабот,
	|	НачисленияПоПроектамОбороты.Роль,
	|	СУММА(ВЫРАЗИТЬ(НачисленияПоПроектамОбороты.ОплаченноеВремяОборот / 3600 КАК ЧИСЛО(15, 2))) КАК НачисленоЧас,
	|	СУММА(НачисленияПоПроектамОбороты.СуммаОборот) КАК Начислено
	|ПОМЕСТИТЬ НачисленияПрошлыйПериод
	|ИЗ
	|	РегистрНакопления.НачисленияПоПроектам.Обороты(, ДОБАВИТЬКДАТЕ(&ДатаНач, СЕКУНДА, -1), , ) КАК НачисленияПоПроектамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияПоПроектамОбороты.Источник,
	|	НачисленияПоПроектамОбороты.ВидРабот,
	|	НачисленияПоПроектамОбороты.ПроектнаяЗадача,
	|	НачисленияПоПроектамОбороты.Роль,
	|	НачисленияПоПроектамОбороты.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТрудоЗатратыТекПериод.Источник КАК Источник,
	|	ТрудоЗатратыТекПериод.Проект КАК Проект,
	|	ТрудоЗатратыТекПериод.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ТрудоЗатратыТекПериод.ВидРабот КАК ВидРабот,
	|	ТрудоЗатратыТекПериод.РольПользователя КАК РольПользователя,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТрудоЗатратыПрошлыйПериод.Трудозатраты, 0) / 3600 КАК ЧИСЛО(15, 2)) КАК Трудозатраты,
	|	ЕСТЬNULL(НачисленияПрошлыйПериод.НачисленоЧас, 0) КАК НачисленоЧас,
	|	ЕСТЬNULL(НачисленияПрошлыйПериод.Начислено, 0) КАК Начислено,
	|	ВЫРАЗИТЬ(СвязьОценок.ОценкаПрошлыйПериод / 3600 КАК ЧИСЛО(15, 2)) КАК ОценкаПрошлыйПериод,
	|	ВЫРАЗИТЬ(СвязьОценок.ОценкаПолная / 3600 КАК ЧИСЛО(15, 2)) КАК ОценкаПолная,
	|	ВЫРАЗИТЬ((СвязьОценок.ОценкаТекПериод - СвязьОценок.ОценкаПрошлыйПериод) / 3600 КАК ЧИСЛО(15, 2)) КАК РазницаОценок
	|ИЗ
	|	ТрудоЗатратыТекПериод КАК ТрудоЗатратыТекПериод
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияПрошлыйПериод КАК НачисленияПрошлыйПериод
	|		ПО ТрудоЗатратыТекПериод.РольПользователя = НачисленияПрошлыйПериод.Роль
	|			И ТрудоЗатратыТекПериод.ВидРабот = НачисленияПрошлыйПериод.ВидРабот
	|			И ТрудоЗатратыТекПериод.ПроектнаяЗадача = НачисленияПрошлыйПериод.ПроектнаяЗадача
	|			И ТрудоЗатратыТекПериод.Проект = НачисленияПрошлыйПериод.Проект
	|			И ТрудоЗатратыТекПериод.Источник = НачисленияПрошлыйПериод.Источник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТрудоЗатратыПрошлыйПериод КАК ТрудоЗатратыПрошлыйПериод
	|		ПО ТрудоЗатратыТекПериод.Источник = ТрудоЗатратыПрошлыйПериод.Источник
	|			И ТрудоЗатратыТекПериод.Проект = ТрудоЗатратыПрошлыйПериод.Проект
	|			И ТрудоЗатратыТекПериод.ПроектнаяЗадача = ТрудоЗатратыПрошлыйПериод.ПроектнаяЗадача
	|			И ТрудоЗатратыТекПериод.ВидРабот = ТрудоЗатратыПрошлыйПериод.ВидРабот
	|			И ТрудоЗатратыТекПериод.РольПользователя = ТрудоЗатратыПрошлыйПериод.РольПользователя
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязьОценок КАК СвязьОценок
	|		ПО ТрудоЗатратыТекПериод.Источник = СвязьОценок.Заявка
	|			И ТрудоЗатратыТекПериод.РольПользователя = СвязьОценок.Роль";

	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Сотрудник",Объект.Сотрудник);

	ТаблицаДопДанных = Запрос.Выполнить().Выгрузить();
	
	Возврат  ТаблицаДопДанных;
КонецФункции

&НаСервере
Процедура ДополнитьТаблицуНачисленийСервер(ИзменятьданныеНачислений)
	ТаблицаДопДанных = ПолучитьДополнительныеДанныеНачисления();
	
	СтруктураПоиска = Новый Структура();
	
	Для Каждого Стр Из Объект.Начисления Цикл
		СтруктураПоиска.Очистить();
		СтруктураПоиска.Вставить("Проект",Стр.Проект);
		СтруктураПоиска.Вставить("ПроектнаяЗадача",Стр.ПроектнаяЗадача);
		СтруктураПоиска.Вставить("Источник",Стр.Источник);
		СтруктураПоиска.Вставить("ВидРабот",Стр.ВидРабот);
		СтруктураПоиска.Вставить("РольПользователя",Стр.Роль);
		
		МассивСтрок = ТаблицаДопДанных.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество()<> 0 Тогда
			ТекСтрока = МассивСтрок.Получить(0);
			Если ТипЗнч(Стр.Источник) = Тип("ДокументСсылка.Заявка") Тогда
				Стр.ЗаявкаЗакрыта = Стр.Источник.ЗаявкаЗакрыта;
				Стр.ДатаЗакрытия = Стр.Источник.ДатаЗакрытия;
			КонецЕсли;	
			
			Стр.ТрудозатратыПлан =     ТекСтрока.ОценкаПолная;
			Стр.ТрудозатратыИзмОценки =  ТекСтрока.РазницаОценок;
			Стр.ТрудозатратыНаНачПериода =  ТекСтрока.Трудозатраты;

			Стр.НачисленоДоТекПериодаЧас = ТекСтрока.НачисленоЧас;
			Стр.НачисленоДоТекПериода = ТекСтрока.Начислено;
			                  
			Если ИзменятьданныеНачислений Тогда
				Если Стр.ТрудозатратыПлан - Стр.НачисленоДоТекПериодаЧас <= 0 Тогда 
					Стр.НачисленоЧасов = 0;
				ИначеЕсли Стр.ТрудозатратыПлан - Стр.НачисленоДоТекПериодаЧас >= Стр.Трудозатраты Тогда 	
					ЗаявкаЗакрытаВЭтомМесяце = Стр.ЗаявкаЗакрыта И НачалоМесяца(Стр.ДатаЗакрытия ) = Объект.ПериодРегистрации;
					Стр.НачисленоЧасов = ?(ЗаявкаЗакрытаВЭтомМесяце,Стр.ТрудозатратыПлан - Стр.НачисленоДоТекПериодаЧас,Стр.Трудозатраты);
				ИначеЕсли Стр.ТрудозатратыПлан - Стр.НачисленоДоТекПериодаЧас <= Стр.Трудозатраты Тогда 	
					Стр.НачисленоЧасов = Стр.ТрудозатратыПлан - Стр.НачисленоДоТекПериодаЧас;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Процедура РассчитатьНачисленияСервер()
	Для Каждого Стр Из Объект.Начисления Цикл
		Стр.Начислено = Стр.НачисленоЧасов*Стр.Тариф;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачисленияПозакрытымЗаявкам(Команда)
	//Проверим заполненность реквизитов
	Если не ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		ПоказатьПредупреждение(Неопределено, "Не указан сотрудник для начисления!");
		Возврат;
	КонецЕсли;	
	
	Если не ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		ПоказатьПредупреждение(Неопределено, "Не указан месяц начисления!");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Перезаполнить начисления по закрытым заявкам для сотрудника?";
	
	Если Объект.НачисленияПоЗакрытымЗаявкам.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьНачисленияПозакрытымЗаявкамЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
        Возврат;	
	Иначе
		ЗаполнитьТаблицуНачисленийПоЗакрытымЗаявкам();
	КонецЕсли;
	ЗаполнитьНачисленияПозакрытымЗаявкамФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачисленияПозакрытымЗаявкамЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуНачисленийПоЗакрытымЗаявкам();
	КонецЕсли;	
	
	ЗаполнитьНачисленияПозакрытымЗаявкамФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНачисленияПозакрытымЗаявкамФрагмент()
	
	ЭтотОбъект.Модифицированность = истина;

КонецПроцедуры

Процедура ЗаполнитьТаблицуНачисленийПоЗакрытымЗаявкам()
	Объект.НачисленияПоЗакрытымЗаявкам.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ФактическиеТрудозатраты.Длительность) КАК Длительность,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.РольПользователя,
	|	ФактическиеТрудозатраты.МесяцНачисления
	|ПОМЕСТИТЬ ФактТрудозатраты
	|ИЗ
	|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.РольПользователя,
	|	ФактическиеТрудозатраты.МесяцНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявка.Проект,
	|	Заявка.ПроектнаяЗадача,
	|	Заявка.Ссылка КАК Источник
	|ПОМЕСТИТЬ ЗакрытыеЗаявки
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(Заявка.ДатаЗакрытия, МЕСЯЦ) = &ДатаМесяца
	|	И Заявка.ЗаявкаЗакрыта = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	Заявка.Проект,
	|	Заявка.ПроектнаяЗадача,
	|	Заявка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеТрудозатратыПоЗаявкам.Источник КАК Заявка,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель КАК Роль,
	|	МАКСИМУМ(ПлановыеТрудозатратыПоЗаявкам.Длительность) КАК Оценка
	|ПОМЕСТИТЬ ОценкаТекПериод
	|ИЗ
	|	РегистрСведений.ПлановыеТрудозатратыПоЗаявкам.СрезПоследних(&ДатаКон, ) КАК ПлановыеТрудозатратыПоЗаявкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатратыПоЗаявкам.Источник,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеТрудозатратыПоЗаявкам.Источник КАК Заявка,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель КАК Роль,
	|	МАКСИМУМ(ПлановыеТрудозатратыПоЗаявкам.Длительность) КАК Оценка
	|ПОМЕСТИТЬ ОценкаПрошлыйПериод
	|ИЗ
	|	РегистрСведений.ПлановыеТрудозатратыПоЗаявкам.СрезПоследних(ДОБАВИТЬКДАТЕ(&ДатаМесяца, СЕКУНДА, -1), ) КАК ПлановыеТрудозатратыПоЗаявкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатратыПоЗаявкам.Источник,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеТрудозатратыПоЗаявкам.Источник КАК Заявка,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель КАК Роль,
	|	МАКСИМУМ(ПлановыеТрудозатратыПоЗаявкам.Длительность) КАК Оценка
	|ПОМЕСТИТЬ ОценкаПолная
	|ИЗ
	|	РегистрСведений.ПлановыеТрудозатратыПоЗаявкам.СрезПоследних(, ) КАК ПлановыеТрудозатратыПоЗаявкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатратыПоЗаявкам.Источник,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОценкаПрошлыйПериод.Оценка, 0) КАК ОценкаПрошлыйПериод,
	|	ЕСТЬNULL(ОценкаТекПериод.Оценка, 0) КАК ОценкаТекПериод,
	|	ЕСТЬNULL(ОценкаПрошлыйПериод.Заявка, ОценкаТекПериод.Заявка) КАК Заявка,
	|	ЕСТЬNULL(ОценкаПрошлыйПериод.Роль, ОценкаТекПериод.Роль) КАК Роль,
	|	ОценкаПолная.Оценка КАК ОценкаПолная
	|ПОМЕСТИТЬ СвязьОценок
	|ИЗ
	|	ОценкаПолная КАК ОценкаПолная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОценкаПрошлыйПериод КАК ОценкаПрошлыйПериод
	|		ПО ОценкаПолная.Роль = ОценкаПрошлыйПериод.Роль
	|			И ОценкаПолная.Заявка = ОценкаПрошлыйПериод.Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОценкаПолная КАК ОценкаТекПериод
	|		ПО ОценкаПолная.Заявка = ОценкаТекПериод.Заявка
	|			И ОценкаПолная.Роль = ОценкаТекПериод.Роль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытыеЗаявки.Источник,
	|	ЗакрытыеЗаявки.ПроектнаяЗадача,
	|	ЗакрытыеЗаявки.Проект,
	|	СвязьОценок.ОценкаПрошлыйПериод,
	|	СвязьОценок.ОценкаТекПериод,
	|	СвязьОценок.Роль,
	|	СвязьОценок.ОценкаПолная,
	|	СвязьОценок.ОценкаТекПериод - СвязьОценок.ОценкаПрошлыйПериод КАК РазницаОценок
	|ПОМЕСТИТЬ ЗаявкиСОценкой
	|ИЗ
	|	ЗакрытыеЗаявки КАК ЗакрытыеЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязьОценок КАК СвязьОценок
	|		ПО ЗакрытыеЗаявки.Источник = СвязьОценок.Заявка
	|ГДЕ
	|	СвязьОценок.ОценкаПолная <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиСОценкой.Источник,
	|	ЗаявкиСОценкой.ПроектнаяЗадача,
	|	ЗаявкиСОценкой.Проект,
	|	ЗаявкиСОценкой.ОценкаПрошлыйПериод,
	|	ЗаявкиСОценкой.ОценкаТекПериод,
	|	ЗаявкиСОценкой.Роль,
	|	ЗаявкиСОценкой.ОценкаПолная,
	|	ЗаявкиСОценкой.РазницаОценок
	|ПОМЕСТИТЬ ОценкаЗакрытыхЗаявок
	|ИЗ
	|	ЗаявкиСОценкой КАК ЗаявкиСОценкой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФактТрудозатраты КАК ФактТрудозатраты
	|		ПО ЗаявкиСОценкой.Источник = ФактТрудозатраты.Источник
	|			И ЗаявкиСОценкой.Роль = ФактТрудозатраты.РольПользователя
	|			И (НАЧАЛОПЕРИОДА(ФактТрудозатраты.МесяцНачисления, МЕСЯЦ) = &ДатаМесяца)
	|ГДЕ
	|	ФактТрудозатраты.МесяцНачисления ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.РольПользователя,
	|	СУММА(ВЫРАЗИТЬ(ФактическиеТрудозатраты.Длительность / 3600 КАК ЧИСЛО(15, 2))) КАК Трудозатраты
	|ПОМЕСТИТЬ ТрудоЗатратыПрошлыйПериод
	|ИЗ
	|	ФактТрудозатраты КАК ФактическиеТрудозатраты
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ФактическиеТрудозатраты.МесяцНачисления, МЕСЯЦ) < &ДатаМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.РольПользователя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияПоПроектамОбороты.Проект,
	|	НачисленияПоПроектамОбороты.ПроектнаяЗадача,
	|	НачисленияПоПроектамОбороты.Источник,
	|	НачисленияПоПроектамОбороты.Роль,
	|	СУММА(ВЫРАЗИТЬ(НачисленияПоПроектамОбороты.ОплаченноеВремяОборот / 3600 КАК ЧИСЛО(15, 2))) КАК НачисленоЧас,
	|	СУММА(НачисленияПоПроектамОбороты.СуммаОборот) КАК Начислено
	|ПОМЕСТИТЬ НачисленияПрошлыйПериод
	|ИЗ
	|	РегистрНакопления.НачисленияПоПроектам.Обороты(, ДОБАВИТЬКДАТЕ(&ДатаМесяца, СЕКУНДА, -1), , ) КАК НачисленияПоПроектамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияПоПроектамОбороты.Источник,
	|	НачисленияПоПроектамОбороты.ПроектнаяЗадача,
	|	НачисленияПоПроектамОбороты.Роль,
	|	НачисленияПоПроектамОбороты.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияПоПроектамОбороты.Проект,
	|	НачисленияПоПроектамОбороты.ПроектнаяЗадача,
	|	НачисленияПоПроектамОбороты.Источник,
	|	НачисленияПоПроектамОбороты.Роль,
	|	СУММА(ВЫРАЗИТЬ(НачисленияПоПроектамОбороты.ОплаченноеВремяОборот / 3600 КАК ЧИСЛО(15, 2))) КАК НачисленоЧас,
	|	СУММА(НачисленияПоПроектамОбороты.СуммаОборот) КАК Начислено
	|ПОМЕСТИТЬ НачисленияТекущийПериод
	|ИЗ
	|	РегистрНакопления.НачисленияПоПроектам.Обороты(&ДатаМесяца, КОНЕЦПЕРИОДА(&ДатаМесяца, МЕСЯЦ), , ) КАК НачисленияПоПроектамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияПоПроектамОбороты.Источник,
	|	НачисленияПоПроектамОбороты.ПроектнаяЗадача,
	|	НачисленияПоПроектамОбороты.Роль,
	|	НачисленияПоПроектамОбороты.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОценкаЗакрытыхЗаявок.Проект,
	|	ОценкаЗакрытыхЗаявок.ПроектнаяЗадача,
	|	ОценкаЗакрытыхЗаявок.Источник,
	|	ЕСТЬNULL(ЕСТЬNULL(ТарифыПоВидамРаботСрезПоследних.Тариф, ВложенныйЗапрос.Тариф), 0) КАК Тариф,
	|	ОценкаЗакрытыхЗаявок.Роль,
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаПолная / 3600 КАК ЧИСЛО(15, 2)) КАК ОценкаПолная,
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаПрошлыйПериод / 3600 КАК ЧИСЛО(15, 2)) КАК ОценкаПрошлыйПериод,
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаТекПериод / 3600 КАК ЧИСЛО(15, 2)) КАК ОценкаТекПериод,
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.РазницаОценок / 3600 КАК ЧИСЛО(15, 2)) КАК РазницаОценок
	|ПОМЕСТИТЬ ЗаявкиСТарифомИОценкой
	|ИЗ
	|	ОценкаЗакрытыхЗаявок КАК ОценкаЗакрытыхЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПоВидамРабот.СрезПоследних(&ДатаКон, Сотрудник = &Сотрудник) КАК ТарифыПоВидамРаботСрезПоследних
	|		ПО ОценкаЗакрытыхЗаявок.Проект = ТарифыПоВидамРаботСрезПоследних.Проект
	|			И ОценкаЗакрытыхЗаявок.Роль = ТарифыПоВидамРаботСрезПоследних.РольНаПроекте
	|			И (ТарифыПоВидамРаботСрезПоследних.Сотрудник = &Сотрудник)
	|			И (ТарифыПоВидамРаботСрезПоследних.ВидРабот = &Видработ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТарифыПоВидамРаботСрезПоследних.Сотрудник КАК Сотрудник,
	|			ТарифыПоВидамРаботСрезПоследних.ВидРабот КАК ВидРабот,
	|			ТарифыПоВидамРаботСрезПоследних.РольНаПроекте КАК РольНаПроекте,
	|			МАКСИМУМ(ТарифыПоВидамРаботСрезПоследних.Тариф) КАК Тариф
	|		ИЗ
	|			РегистрСведений.ТарифыПоВидамРабот.СрезПоследних(&ДатаКон, Сотрудник = &Сотрудник) КАК ТарифыПоВидамРаботСрезПоследних
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТарифыПоВидамРаботСрезПоследних.Сотрудник,
	|			ТарифыПоВидамРаботСрезПоследних.ВидРабот,
	|			ТарифыПоВидамРаботСрезПоследних.РольНаПроекте) КАК ВложенныйЗапрос
	|		ПО ОценкаЗакрытыхЗаявок.Роль = ВложенныйЗапрос.РольНаПроекте
	|			И (ВложенныйЗапрос.Сотрудник = &Сотрудник)
	|			И (ВложенныйЗапрос.ВидРабот = &Видработ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОценкаЗакрытыхЗаявок.Проект,
	|	ОценкаЗакрытыхЗаявок.ПроектнаяЗадача,
	|	ОценкаЗакрытыхЗаявок.Источник,
	|	ОценкаЗакрытыхЗаявок.Роль,
	|	ЕСТЬNULL(ЕСТЬNULL(ТарифыПоВидамРаботСрезПоследних.Тариф, ВложенныйЗапрос.Тариф), 0),
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаПолная / 3600 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаПрошлыйПериод / 3600 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаТекПериод / 3600 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.РазницаОценок / 3600 КАК ЧИСЛО(15, 2))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиСТарифомИОценкой.Источник,
	|	ЗаявкиСТарифомИОценкой.Проект,
	|	ЗаявкиСТарифомИОценкой.ПроектнаяЗадача,
	|	&ВидРабот КАК ВидРабот,
	|	ЗаявкиСТарифомИОценкой.Тариф,
	|	ЗаявкиСТарифомИОценкой.Роль,
	|	ЗаявкиСТарифомИОценкой.ОценкаПолная КАК ТрудозатратыПлан,
	|	ЗаявкиСТарифомИОценкой.ОценкаПрошлыйПериод,
	|	ЗаявкиСТарифомИОценкой.ОценкаТекПериод,
	|	ЗаявкиСТарифомИОценкой.РазницаОценок КАК ТрудозатратыИзмОценки,
	|	НачисленияПрошлыйПериод.НачисленоЧас КАК НачисленоДоТекПериодаЧас,
	|	НачисленияПрошлыйПериод.Начислено КАК НачисленоДоТекПериода,
	|	ТрудоЗатратыПрошлыйПериод.Трудозатраты КАК ТрудозатратыНаНачПериода,
	|	ЗаявкиСТарифомИОценкой.ОценкаПолная - (ЕСТЬNULL(НачисленияПрошлыйПериод.НачисленоЧас, 0) + ЕСТЬNULL(НачисленияТекущийПериод.НачисленоЧас, 0)) КАК ТрудозатратыОстаток,
	|	ЗаявкиСТарифомИОценкой.Источник.ЗаявкаЗакрыта КАК ЗаявкаЗакрыта,
	|	ЗаявкиСТарифомИОценкой.Источник.ДатаЗакрытия КАК ДатаЗакрытия
	|ИЗ
	|	ЗаявкиСТарифомИОценкой КАК ЗаявкиСТарифомИОценкой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТрудоЗатратыПрошлыйПериод КАК ТрудоЗатратыПрошлыйПериод
	|		ПО ЗаявкиСТарифомИОценкой.Проект = ТрудоЗатратыПрошлыйПериод.Проект
	|			И ЗаявкиСТарифомИОценкой.ПроектнаяЗадача = ТрудоЗатратыПрошлыйПериод.ПроектнаяЗадача
	|			И ЗаявкиСТарифомИОценкой.Источник = ТрудоЗатратыПрошлыйПериод.Источник
	|			И ЗаявкиСТарифомИОценкой.Роль = ТрудоЗатратыПрошлыйПериод.РольПользователя
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияПрошлыйПериод КАК НачисленияПрошлыйПериод
	|		ПО ЗаявкиСТарифомИОценкой.Проект = НачисленияПрошлыйПериод.Проект
	|			И ЗаявкиСТарифомИОценкой.ПроектнаяЗадача = НачисленияПрошлыйПериод.ПроектнаяЗадача
	|			И ЗаявкиСТарифомИОценкой.Источник = НачисленияПрошлыйПериод.Источник
	|			И ЗаявкиСТарифомИОценкой.Роль = НачисленияПрошлыйПериод.Роль
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияТекущийПериод КАК НачисленияТекущийПериод
	|		ПО ЗаявкиСТарифомИОценкой.Проект = НачисленияТекущийПериод.Проект
	|			И ЗаявкиСТарифомИОценкой.ПроектнаяЗадача = НачисленияТекущийПериод.ПроектнаяЗадача
	|			И ЗаявкиСТарифомИОценкой.Источник = НачисленияТекущийПериод.Источник
	|			И ЗаявкиСТарифомИОценкой.Роль = НачисленияТекущийПериод.Роль
	|ГДЕ
	|	ЗаявкиСТарифомИОценкой.ОценкаПолная - (ЕСТЬNULL(НачисленияПрошлыйПериод.НачисленоЧас, 0) + ЕСТЬNULL(НачисленияТекущийПериод.НачисленоЧас, 0)) <> 0";

	Запрос.УстановитьПараметр("ДатаМесяца", НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Сотрудник",Объект.Сотрудник);
	Запрос.УстановитьПараметр("ВидРабот",Справочники.ВидыРабот.ЗакрытиеЗаявок);
	
	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияПоПроектамОбороты.Источник
		|ИЗ
		|	РегистрНакопления.НачисленияПоПроектам.Обороты(&ДатаС, &ДатаПо, , Пользователь = &Пользователь) КАК НачисленияПоПроектамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияПоПроектамОбороты.Источник";

	Запрос.УстановитьПараметр("ДатаПо", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаС", НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Пользователь", Объект.Сотрудник);
	
	ТаблицаПроизведенныхНачислений = Запрос.Выполнить().Выгрузить();
	СтруктураПоиска = Новый Структура();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПоиска.Очистить();
		СтруктураПоиска.Вставить("Источник",ВыборкаДетальныеЗаписи.Источник);
		МассивСтрок = ТаблицаПроизведенныхНачислений.НайтиСтроки(СтруктураПоиска);
		Если МассивСтрок.Количество() <> 0 Тогда
			Сообщить("Для "+ВыборкаДетальныеЗаписи.Источник+" уже было начисление в этом месяце",СтатусСообщения.Важное);
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = Объект.НачисленияПоЗакрытымЗаявкам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьДокументИсточникаЗакрытойЗаявки(Команда)
	ТекСтрока = Элементы.НачисленияПоЗакрытымЗаявкам.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда 
		Источник = ТекСтрока.Источник;
		ПоказатьЗначение(Неопределено, Источник); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПоЗакрытымЗаявкамНачисленоЧасовПриИзменении(Элемент)
	ТекСтрока = Элементы.НачисленияПоЗакрытымЗаявкам.ТекущиеДанные;
	ТекСтрока.Начислено = ТекСтрока.НачисленоЧасов*ТекСтрока.Тариф;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЗаявку(Команда)
	ПараметрыФормы = Новый Структура("ЗаявкаЗакрыта", Истина);
 
	ФормаВыбора = ПолучитьФорму("Документ.Заявка.ФормаВыбора",ПараметрыФормы);
	Рез = ФормаВыбора.ОткрытьМодально();
	
	Если Рез <> Неопределено Тогда
		Отказ = Ложь;
		
		ДобавитьСтрокуПоЗакрытойЗаявке(Рез,Отказ);
		
		Если Отказ = Истина Тогда
			ПоказатьПредупреждение(Неопределено, "По выбранной заявке не найдена информация по плановому времени. Строки не будут добавлены!");
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуЗакрытойЗаявки(Команда)
	ТекСтрока = Элементы.НачисленияПоЗакрытымЗаявкам.ТекущиеДанные;
	Если ТекСтрока <> Неопределено Тогда 
		Объект.НачисленияПоЗакрытымЗаявкам.Удалить(ТекСтрока);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПоЗакрытойЗаявке(Заявка,Отказ)

	Если Не Заявка.ЗаявкаЗакрыта Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ФактическиеТрудозатраты.Длительность) КАК Длительность,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.РольПользователя,
	|	ФактическиеТрудозатраты.МесяцНачисления
	|ПОМЕСТИТЬ ФактТрудозатраты
	|ИЗ
	|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.РольПользователя,
	|	ФактическиеТрудозатраты.МесяцНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заявка.Проект,
	|	Заявка.ПроектнаяЗадача,
	|	Заявка.Ссылка КАК Источник
	|ПОМЕСТИТЬ ЗакрытыеЗаявки
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	Заявка.Ссылка = &Заявка
	|
	|СГРУППИРОВАТЬ ПО
	|	Заявка.Проект,
	|	Заявка.ПроектнаяЗадача,
	|	Заявка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеТрудозатратыПоЗаявкам.Источник КАК Заявка,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель КАК Роль,
	|	МАКСИМУМ(ПлановыеТрудозатратыПоЗаявкам.Длительность) КАК Оценка
	|ПОМЕСТИТЬ ОценкаТекПериод
	|ИЗ
	|	РегистрСведений.ПлановыеТрудозатратыПоЗаявкам.СрезПоследних(&ДатаКон, ) КАК ПлановыеТрудозатратыПоЗаявкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатратыПоЗаявкам.Источник,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеТрудозатратыПоЗаявкам.Источник КАК Заявка,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель КАК Роль,
	|	МАКСИМУМ(ПлановыеТрудозатратыПоЗаявкам.Длительность) КАК Оценка
	|ПОМЕСТИТЬ ОценкаПрошлыйПериод
	|ИЗ
	|	РегистрСведений.ПлановыеТрудозатратыПоЗаявкам.СрезПоследних(ДОБАВИТЬКДАТЕ(&ДатаМесяца, СЕКУНДА, -1), ) КАК ПлановыеТрудозатратыПоЗаявкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатратыПоЗаявкам.Источник,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеТрудозатратыПоЗаявкам.Источник КАК Заявка,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель КАК Роль,
	|	МАКСИМУМ(ПлановыеТрудозатратыПоЗаявкам.Длительность) КАК Оценка
	|ПОМЕСТИТЬ ОценкаПолная
	|ИЗ
	|	РегистрСведений.ПлановыеТрудозатратыПоЗаявкам.СрезПоследних(, ) КАК ПлановыеТрудозатратыПоЗаявкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеТрудозатратыПоЗаявкам.Источник,
	|	ПлановыеТрудозатратыПоЗаявкам.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОценкаПрошлыйПериод.Оценка, 0) КАК ОценкаПрошлыйПериод,
	|	ЕСТЬNULL(ОценкаТекПериод.Оценка, 0) КАК ОценкаТекПериод,
	|	ЕСТЬNULL(ОценкаПрошлыйПериод.Заявка, ОценкаТекПериод.Заявка) КАК Заявка,
	|	ЕСТЬNULL(ОценкаПрошлыйПериод.Роль, ОценкаТекПериод.Роль) КАК Роль,
	|	ОценкаПолная.Оценка КАК ОценкаПолная
	|ПОМЕСТИТЬ СвязьОценок
	|ИЗ
	|	ОценкаПолная КАК ОценкаПолная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОценкаПрошлыйПериод КАК ОценкаПрошлыйПериод
	|		ПО ОценкаПолная.Роль = ОценкаПрошлыйПериод.Роль
	|			И ОценкаПолная.Заявка = ОценкаПрошлыйПериод.Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОценкаПолная КАК ОценкаТекПериод
	|		ПО ОценкаПолная.Заявка = ОценкаТекПериод.Заявка
	|			И ОценкаПолная.Роль = ОценкаТекПериод.Роль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытыеЗаявки.Источник,
	|	ЗакрытыеЗаявки.ПроектнаяЗадача,
	|	ЗакрытыеЗаявки.Проект,
	|	СвязьОценок.ОценкаПрошлыйПериод,
	|	СвязьОценок.ОценкаТекПериод,
	|	СвязьОценок.Роль,
	|	СвязьОценок.ОценкаПолная,
	|	СвязьОценок.ОценкаТекПериод - СвязьОценок.ОценкаПрошлыйПериод КАК РазницаОценок
	|ПОМЕСТИТЬ ОценкаЗакрытыхЗаявок
	|ИЗ
	|	ЗакрытыеЗаявки КАК ЗакрытыеЗаявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязьОценок КАК СвязьОценок
	|		ПО ЗакрытыеЗаявки.Источник = СвязьОценок.Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.РольПользователя,
	|	СУММА(ВЫРАЗИТЬ(ФактическиеТрудозатраты.Длительность / 3600 КАК ЧИСЛО(15, 2))) КАК Трудозатраты
	|ПОМЕСТИТЬ ТрудоЗатратыПрошлыйПериод
	|ИЗ
	|	ФактТрудозатраты КАК ФактическиеТрудозатраты
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ФактическиеТрудозатраты.МесяцНачисления, МЕСЯЦ) < &ДатаМесяца
	|
	|СГРУППИРОВАТЬ ПО
	|	ФактическиеТрудозатраты.Источник,
	|	ФактическиеТрудозатраты.Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.РольПользователя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияПоПроектамОбороты.Проект,
	|	НачисленияПоПроектамОбороты.ПроектнаяЗадача,
	|	НачисленияПоПроектамОбороты.Источник,
	|	НачисленияПоПроектамОбороты.Роль,
	|	СУММА(ВЫРАЗИТЬ(НачисленияПоПроектамОбороты.ОплаченноеВремяОборот / 3600 КАК ЧИСЛО(15, 2))) КАК НачисленоЧас,
	|	СУММА(НачисленияПоПроектамОбороты.СуммаОборот) КАК Начислено
	|ПОМЕСТИТЬ НачисленияПрошлыйПериод
	|ИЗ
	|	РегистрНакопления.НачисленияПоПроектам.Обороты(, ДОБАВИТЬКДАТЕ(&ДатаМесяца, СЕКУНДА, -1), , ) КАК НачисленияПоПроектамОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияПоПроектамОбороты.Источник,
	|	НачисленияПоПроектамОбороты.ПроектнаяЗадача,
	|	НачисленияПоПроектамОбороты.Роль,
	|	НачисленияПоПроектамОбороты.Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОценкаЗакрытыхЗаявок.Проект,
	|	ОценкаЗакрытыхЗаявок.ПроектнаяЗадача,
	|	ОценкаЗакрытыхЗаявок.Источник,
	|	ЕСТЬNULL(ЕСТЬNULL(ТарифыПоВидамРаботСрезПоследних.Тариф, ВложенныйЗапрос.Тариф), 0) КАК Тариф,
	|	ОценкаЗакрытыхЗаявок.Роль,
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаПолная / 3600 КАК ЧИСЛО(15, 2)) КАК ОценкаПолная,
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаПрошлыйПериод / 3600 КАК ЧИСЛО(15, 2)) КАК ОценкаПрошлыйПериод,
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаТекПериод / 3600 КАК ЧИСЛО(15, 2)) КАК ОценкаТекПериод,
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.РазницаОценок / 3600 КАК ЧИСЛО(15, 2)) КАК РазницаОценок
	|ПОМЕСТИТЬ ЗаявкиСТарифомИОценкой
	|ИЗ
	|	ОценкаЗакрытыхЗаявок КАК ОценкаЗакрытыхЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыПоВидамРабот.СрезПоследних(&ДатаКон, Сотрудник = &Сотрудник) КАК ТарифыПоВидамРаботСрезПоследних
	|		ПО ОценкаЗакрытыхЗаявок.Проект = ТарифыПоВидамРаботСрезПоследних.Проект
	|			И ОценкаЗакрытыхЗаявок.Роль = ТарифыПоВидамРаботСрезПоследних.РольНаПроекте
	|			И (ТарифыПоВидамРаботСрезПоследних.Сотрудник = &Сотрудник)
	|			И (ТарифыПоВидамРаботСрезПоследних.ВидРабот = &Видработ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТарифыПоВидамРаботСрезПоследних.Сотрудник КАК Сотрудник,
	|			ТарифыПоВидамРаботСрезПоследних.ВидРабот КАК ВидРабот,
	|			ТарифыПоВидамРаботСрезПоследних.РольНаПроекте КАК РольНаПроекте,
	|			МАКСИМУМ(ТарифыПоВидамРаботСрезПоследних.Тариф) КАК Тариф
	|		ИЗ
	|			РегистрСведений.ТарифыПоВидамРабот.СрезПоследних(&ДатаКон, Сотрудник = &Сотрудник) КАК ТарифыПоВидамРаботСрезПоследних
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТарифыПоВидамРаботСрезПоследних.Сотрудник,
	|			ТарифыПоВидамРаботСрезПоследних.ВидРабот,
	|			ТарифыПоВидамРаботСрезПоследних.РольНаПроекте) КАК ВложенныйЗапрос
	|		ПО ОценкаЗакрытыхЗаявок.Роль = ВложенныйЗапрос.РольНаПроекте
	|			И (ВложенныйЗапрос.Сотрудник = &Сотрудник)
	|			И (ВложенныйЗапрос.ВидРабот = &Видработ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОценкаЗакрытыхЗаявок.Проект,
	|	ОценкаЗакрытыхЗаявок.ПроектнаяЗадача,
	|	ОценкаЗакрытыхЗаявок.Источник,
	|	ОценкаЗакрытыхЗаявок.Роль,
	|	ЕСТЬNULL(ЕСТЬNULL(ТарифыПоВидамРаботСрезПоследних.Тариф, ВложенныйЗапрос.Тариф), 0),
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаПолная / 3600 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаПрошлыйПериод / 3600 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.ОценкаТекПериод / 3600 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ОценкаЗакрытыхЗаявок.РазницаОценок / 3600 КАК ЧИСЛО(15, 2))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиСТарифомИОценкой.Источник,
	|	ЗаявкиСТарифомИОценкой.Проект,
	|	ЗаявкиСТарифомИОценкой.ПроектнаяЗадача,
	|	&ВидРабот КАК ВидРабот,
	|	ЗаявкиСТарифомИОценкой.Тариф,
	|	ЗаявкиСТарифомИОценкой.Роль,
	|	ЗаявкиСТарифомИОценкой.ОценкаПолная КАК ТрудозатратыПлан,
	|	ЗаявкиСТарифомИОценкой.ОценкаПрошлыйПериод,
	|	ЗаявкиСТарифомИОценкой.ОценкаТекПериод,
	|	ЗаявкиСТарифомИОценкой.РазницаОценок КАК ТрудозатратыИзмОценки,
	|	НачисленияПрошлыйПериод.НачисленоЧас КАК НачисленоДоТекПериодаЧас,
	|	НачисленияПрошлыйПериод.Начислено КАК НачисленоДоТекПериода,
	|	ТрудоЗатратыПрошлыйПериод.Трудозатраты КАК ТрудозатратыНаНачПериода,
	|	ЗаявкиСТарифомИОценкой.ОценкаПолная - ЕСТЬNULL(НачисленияПрошлыйПериод.НачисленоЧас, 0) КАК ТрудозатратыОстаток,
	|	ЗаявкиСТарифомИОценкой.Источник.ЗаявкаЗакрыта КАК ЗаявкаЗакрыта,
	|	ЗаявкиСТарифомИОценкой.Источник.ДатаЗакрытия КАК ДатаЗакрытия
	|ИЗ
	|	ЗаявкиСТарифомИОценкой КАК ЗаявкиСТарифомИОценкой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТрудоЗатратыПрошлыйПериод КАК ТрудоЗатратыПрошлыйПериод
	|		ПО ЗаявкиСТарифомИОценкой.Проект = ТрудоЗатратыПрошлыйПериод.Проект
	|			И ЗаявкиСТарифомИОценкой.ПроектнаяЗадача = ТрудоЗатратыПрошлыйПериод.ПроектнаяЗадача
	|			И ЗаявкиСТарифомИОценкой.Источник = ТрудоЗатратыПрошлыйПериод.Источник
	|			И ЗаявкиСТарифомИОценкой.Роль = ТрудоЗатратыПрошлыйПериод.РольПользователя
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачисленияПрошлыйПериод КАК НачисленияПрошлыйПериод
	|		ПО ЗаявкиСТарифомИОценкой.Проект = НачисленияПрошлыйПериод.Проект
	|			И ЗаявкиСТарифомИОценкой.ПроектнаяЗадача = НачисленияПрошлыйПериод.ПроектнаяЗадача
	|			И ЗаявкиСТарифомИОценкой.Источник = НачисленияПрошлыйПериод.Источник
	|			И ЗаявкиСТарифомИОценкой.Роль = НачисленияПрошлыйПериод.Роль
	|ГДЕ
	|	ЗаявкиСТарифомИОценкой.ОценкаПолная - ЕСТЬNULL(НачисленияПрошлыйПериод.НачисленоЧас, 0) <> 0";

	Запрос.УстановитьПараметр("ДатаМесяца", НачалоМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("Сотрудник",Объект.Сотрудник);
	Запрос.УстановитьПараметр("ВидРабот",Справочники.ВидыРабот.ЗакрытиеЗаявок);
	Запрос.УстановитьПараметр("Заявка",Заявка);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.НачисленияПоЗакрытымЗаявкам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);		
	КонецЦикла;	
КонецПроцедуры


