//////////////////////////////////////////////////////////////////////////////////////
//СОХРАНЕНИЕ И ВОССТАНОВЛЕНИЕ НАСТРОЕК ДИН. СПИСКАМ

Процедура ВосстановитьНастройкиСписка( пФорма, пИмяСписка) Экспорт
	
	Настройки = ХранилищеНастроекДанныхФорм.Загрузить( пФорма.ИмяФормы,пИмяСписка );

	Если ТипЗнч(Настройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		днСписок = пФорма[пИмяСписка];
	
		днСписок.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
	КонецЕсли;	
КонецПроцедуры


Процедура СохранитьНастройкиСписка( пФорма, пИмяСписка ) Экспорт
	
	днСписок = пФорма[пИмяСписка];
	
	Настройки = днСписок.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	ХранилищеНастроекДанныхФорм.Сохранить( пФорма.ИмяФормы,пИмяСписка, Настройки );
	
КонецПроцедуры

