
&НаКлиенте
Процедура УстановитьПараметрыИспользования(РежимСозданияПараметр) Экспорт
	РежимСоздания = РежимСозданияПараметр;
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьФайлВыполнить()
	Закрыть(РежимСоздания);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДоступнаКомандаСканировать") Тогда
		Если Параметры.ДоступнаКомандаСканировать Тогда
			Элементы.РежимСоздания.СписокВыбора.Добавить(3, "Со сканера");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
