Перем ЗначениеИзменено;

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НовоеЗначение = Значение;
	ЭтотОбъект.Прочитать();
	
	ЗначениеИзменено = Значение <> НовоеЗначение;
	Значение = НовоеЗначение;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЗначениеИзменено Тогда
	//	РегистрыСведений.ОчередьОбновленияДоступа.ОбновитьДоступ(
	//		Перечисления.ВидыЗаданийОбновленияДоступа.ПраваПользователейДляЗаданныхОпределителейДоступа,
	//		Новый Структура("ВидыДоступа", ПланыВидовХарактеристик.ВидыДоступа.Организации));
	//КонецЕсли;
	
КонецПроцедуры
