////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление версии ИБ"
// Серверные процедуры и функции обновления информационной базы
// при смене версии конфигурации.
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Выполнить неинтерактивное обновление данных ИБ.
//
// Принудительно - Булево - если Истина, то обновление ИБ будет выполнено 
//                          даже если версия конфигурации не менялась.
// 
// Результат:
//      Неопределено - обновление не выполнялось (не требуется)
//      Строка       - адрес временного хранилища со списком выполненных обработчиков обновления
//
Функция ВыполнитьОбновлениеИнформационнойБазы(Знач Принудительно = Ложь) Экспорт
	
	Возврат ОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазы(Принудительно);

КонецФункции

